{"id": 7, "text": "Confidential treatment has been requested with respect to portions of this agreement as indicated by “[*]” and such confidential portions have been deleted and filed separately with the Securities and Exchange Commission pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended. Amendment #3 to the Manufacturing Agreement This Amendment #3 to the Manufacturing Agreement (this “Amendment #3”) is made effective as of December 21, 2017 (“Amendment Effective Date”), by and between ADMA BioManufacturing, LLC, a Delaware limited liability company, having a place of business at 5800 Park of Commerce Boulevard NW, Boca Raton, Florida 33487 USA (“ADMA”) and Sanofi Pasteur S.A., a company existing and organized under the laws of France (“Sanofi Pasteur”), having its registered head office at 14, espace Henry Vallee, 69007, Lyon, France. WHEREAS, ADMA (as successor-in-interest to Biotest Pharmaceuticals Corporation (“BPC”) and Sanofi Pasteur are parties to that certain Manufacturi", "labels": [[296, 338, "DOC_NAME"], [345, 387, "DOC_NAME"], [498, 524, "PARTY"], [662, 666, "PARTY"], [673, 692, "PARTY"], [754, 768, "PARTY"], [864, 868, "PARTY"]]}
{"id": 18, "text": "EXHIBIT 10.26 MICOA AGENCY AGREEMENT Mutual Insurance Corporation of America, a Michigan insurance corporation (MICOA) and Stratton, Cheeseman & Walsh-Nevada, Inc., a Nevada corporation, (\"Agency\"), (sometimes commonly referred to as the Parties) agree as follows: A. AUTHORITY OF AGENCY Subject to requirements imposed by law, the underwriting rules, procedures and regulations of MICOA and this agreement, the Agency is authorized to: 1. Solicit within the State of Nevada, receive and transmit immediately and directly to MICOA, proposals for health care liability insurance contracts for which a commission is specified in the schedule of commissions provided by Exhibit A, attached and as amended or supplemented by such attachments from time to time. 2. Produce and deliver certificates of insurance and written binders in accordance with MICOA underwriting requirements. The Agency is not authorized to accept or bind any risk or to otherwise obligate MICOA without specific authority from MIC", "labels": [[14, 19, "PARTY"], [20, 36, "DOC_NAME"], [37, 76, "PARTY"], [112, 117, "PARTY"], [123, 163, "PARTY"], [189, 195, "PARTY"], [200, 245, "PARTY"], [281, 287, "PARTY"], [382, 387, "PARTY"], [412, 418, "PARTY"], [525, 530, "PARTY"], [845, 850, "PARTY"], [882, 888, "PARTY"]]}
{"id": 24, "text": "Exhibit 10.6 OUTSOURCING AGREEMENT dated as of , 2012 TWIN CITIES POWER HOLDINGS, LLC and REDWATER LLC $50,000,000.00 Renewable Unsecured Subordinated Notes TABLE OF CONTENTS ARTICLE I DEFINITIONS 1 Section 1.01 Defined Terms 1 Section 1.02 Accounting Terms 4 ARTICLE II APPOINTMENT OF THE AGENT AND RELATED AGREEMENTS 5 Section 2.01 Appointment; Exclusivity 5 Section 2.02 Scope of Agency 5 Section 2.03 Compensation to the Contractor 6 Section 2.04 Brokers and Dealers 8 Section 2.05 The Contractor’s Unrelated Activities 8 Section 2.06 Best Efforts; Independent Contractor 8 Section 2.07 Issuance and Payment 8 ARTICLE III SERVICES; STANDARD OF CARE 8 Section 3.01 Services for the Notes 8 Section 3.02 Maintenance of Files and Records 11 Section 3.03 Monthly Reports to the Company 12 ARTICLE IV REPRESENTATIONS AND COVENANTS OF THE COMPANY 13 Section 4.01 Representations, Warranties and Agreements of the Company 13 Section 4.02 Covenants of the Company 20 ARTICLE V REPRESENTATIONS AND COVENAN", "labels": [[13, 34, "DOC_NAME"], [54, 85, "PARTY"], [90, 102, "PARTY"], [425, 435, "PARTY"], [490, 500, "PARTY"], [565, 575, "PARTY"], [778, 785, "PARTY"], [837, 844, "PARTY"], [911, 918, "PARTY"]]}
{"id": 35, "text": "Exhibit 10.19 CONFIDENTIAL TREATMENT REQUESTED Certain portions of this document have been omitted pursuant to a request for Confidential Treatment and, where applicable, have been marked with “[*]” to indicate where omissions have been made. The confidential material has been filed separately with the Securities and Exchange Commission. MANUFACTURING AND SUPPLY AGREEMENT This Manufacturing and Supply Agreement (this “Agreement”) is entered into as of the Effective Date (as defined below) by and between (1) Apollo Endosurgery, Delaware corporation having offices at 1120 S Capital of Texas Highway #300, Austin, TX 78746 (“APOLLO”), and (2) Establishment Labs, S.A a corporation organized under the laws of Costa Rica and having a principal place of business at Coyol Free Zone, B15, Alajuela, 20113, Costa Rica (“ESTABLISHMENT”). APOLLO and ESTABLISHMENT shall hereinafter be individually referred to as a “Party” and collectively as the “Parties.” RECITALS A. APOLLO is engaged in the researc", "labels": [[340, 374, "DOC_NAME"], [380, 414, "DOC_NAME"], [513, 531, "PARTY"], [629, 635, "PARTY"], [647, 670, "PARTY"], [820, 833, "PARTY"], [837, 843, "PARTY"], [848, 861, "PARTY"]]}
{"id": 42, "text": "Exhibit 10.1 CERTAIN CONFIDENTIAL PORTIONS OF THIS EXHIBIT HAVE BEEN OMITTED AND REPLACED WITH “[*]”. SUCH IDENTIFIED INFORMATION HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM TO THE COMPANY IF DISCLOSED. Execution Version Network Build and Maintenance Agreement Between Commnet Wireless, LLC And AT&T Mobility LLC Source: ATN INTERNATIONAL, INC., 10-Q, 11/8/2019 Mobility Network General Agreement TABLE OF CONTENTS Page 1.1 Scope 1 1.2 Scope of Agreement 1 1.3 Term of Agreement 1 2.1 Definitions 1 2.2 Affiliate 1 2.3 Agreement 2 2.4 Attorney’s Fees 2 2.5 AT&T Competitor 2 2.6 AT&T Indemnified Parties 2 2.7 Cell Site 2 2.8 Change Management Plan 2 2.9 Change of Control 2 2.10Change Order 2 2.11Control 2 2.12Customer Information 3 2.13Deliverable 3 2.14Delivery or Completion 3 2.15Delivery Date or Completion Date 3 2.16Documentation 4 2.17Drug Screen 4 2.18Employment Claims 4 2.19Excusable Delay 4 2.20FirstNet Authority 4 2.", "labels": [[289, 328, "DOC_NAME"], [337, 358, "PARTY"], [363, 380, "PARTY"], [625, 629, "PARTY"]]}
{"id": 44, "text": "Execution version Exhibit 10.3 CONFIDENTIAL TREATMENT REQUESTED – REDACTED COPY Confidential Treatment has been requested for portions of this Exhibit. Confidential portions of this Exhibit are designated by [*]. A complete version of this Exhibit has been filed separately with the Securities and Exchange Commission. GLOBAL MAINTENANCE AGREEMENT Contract No. DS/CS-3957/14 issue 7 Between AZUL LINHAS AÉREAS BRASILEIRAS S/A (as Company) and AVIONS DE TRANSPORT REGIONAL, G.I.E. (as Repairer) March 9th, 2015 AZUL–ATR Global Maintenance Master Agreement DS/CS-3957/14/Issue 7 Page 1/110 Source: AZUL SA, F-1/A, 3/3/2017 Execution version CONTENTS Clause Page 1. SUBJECT-MATTER OF THE AGREEMENT 6 2. DEFINITIONS AND INTERPRETATION 6 3. DURATION AND RENEWAL 15 4. EXCUSABLE DELAY 15 5. SERVICES, LEASE AND OBLIGATIONS OF THE PARTIES 16 6. DELIVERIES 18 7. WORK ORDERS 20 8. INSURANCES 21 9. WARRANTIES 22 10. PRICES 22 11. RECONCILIATION 22 12. INVOICING AND PAYMENT TERMS 23 13. SECURITY DEPOSIT 26 1", "labels": [[391, 425, "PARTY"]]}
{"id": 55, "text": "AMENDMENT 1 TO DEVELOPMENT AGREEMENT This is the First Amendment (“First Amendment”) to the Development Agreement (“Development Agreement”) entered into on April 15, 2010, by and between Cargill, Incorporated through its Bio Technology Development Center, having its principal place of business at 15407 McGinty Road West, Wayzata, Minnesota 55391 USA (“Cargill”) and BioAmber S.A.S., having a place of business at Route de Bazancourt, F-51110, Pomacle France (“BioAmber”). This First Amendment will be effective as of July 5, 2011, upon the signature of both Cargill and BioAmber. Cargill and Bioamber mutually agree as follows: The Parties, through their authorized representatives, hereby agree to the terms and conditions of this First Amendment. Cargill Confidential * Confidential treatment requested 1. Section 2.2 of the Development Agreement is hereby amended to allow Cargill at its sole discretion to apply [*] during the period of July 5, 2011, through September 30, 2011, to perform the ", "labels": [[49, 64, "DOC_NAME"], [67, 82, "DOC_NAME"], [187, 208, "PARTY"], [354, 361, "PARTY"], [368, 383, "PARTY"], [462, 470, "PARTY"], [479, 494, "DOC_NAME"], [560, 567, "PARTY"], [572, 580, "PARTY"], [582, 589, "PARTY"], [594, 602, "PARTY"], [734, 749, "DOC_NAME"], [751, 758, "PARTY"]]}
{"id": 60, "text": "JOINT FILING AGREEMENT Pursuant to and in accordance with the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and the rules and regulations thereunder, each party hereto hereby agrees to the joint filing, on behalf of each of them, of any filing required by such party under Section 13 or Section 16 of the Exchange Act or any rule or regulation thereunder (including any amendment, restatement, supplement, and/or exhibit thereto) with the Securities and Exchange Commission (and, if such security is registered on a national securities exchange, also with the exchange), and further agrees to the filing, furnishing, and/or incorporation by reference of this agreement as an exhibit thereto. This agreement shall remain in full force and effect until revoked by any party hereto in a signed writing provided to each other party hereto, and then only with respect to such revoking party. IN WITNESS WHEREOF, each party hereto, being duly authorized, has caused this agreement to be", "labels": []}
{"id": 62, "text": "Exhibit 10.27 e-business Hosting Agreement between Bluefly, Inc. and International Business Machines Corporation 1 e-business Hosting Agreement Under this e-business Hosting Agreement (\"Agreement\") between International Business Machines Corporation (\"IBM\") and Bluefly, Inc. (\"Customer\"), IBM will provide Web hosting and related services (\"Services\") to Customer. The Agreement includes these terms and conditions and the documents referenced herein (\"Base Terms\"), e-business hosting services order forms accepted by IBM (\"Order Forms\"), and the following attachments: a. Attachment A: Facilities Services; b. Service Option Attachment for Facilities Services; and c. all other applicable attachments referenced in the Order Forms for Services options selected by Customer (\"Service Option Attachments\"). In the event of a conflict between the Base Terms and an attachment, the Base Terms will govern, except where an attachment or a provision contained therein expressly states that it will gover", "labels": [[14, 42, "DOC_NAME"], [51, 64, "PARTY"], [69, 112, "PARTY"], [115, 143, "DOC_NAME"], [155, 183, "DOC_NAME"], [206, 249, "PARTY"], [252, 255, "PARTY"], [262, 275, "PARTY"], [278, 286, "PARTY"], [290, 293, "PARTY"], [331, 339, "PARTY"], [342, 350, "PARTY"], [356, 364, "PARTY"], [487, 495, "PARTY"], [520, 523, "PARTY"], [600, 608, "PARTY"], [654, 662, "PARTY"], [738, 746, "PARTY"]]}
{"id": 70, "text": "BW-3 FRANCHISE SYSTEMS, INC. FRANCHISE AGREEMENT TABLE OF CONTENTS ARTICLE PAGE - I. APPOINTMENT AND FRANCHISE FEE.....................1 II. TERM AND RENEWAL.......................... .3 III. RESTAURANT AND LOCATION....................... .4 IV. TRAINING.............................. .5 V. PROPRIETARY MARKS...........................6 VI. CONFIDENTIAL MANUALS........................ .7 VII. CONFIDENTIAL INFORMATION...................... .7 VIII. MODIFICATION OF THE SYSTEM......................8 IX. ADVERTISING............................. .8 X. CONTINUING FEE...........................10 XI. ACCOUNTING AND RECORDS.......................12 XII. STANDARDS OF QUALITY AND PERFORMANCE................ 13 XIII. OPERATIONS ASSISTANCE........................17 XIV. INSURANCE..............................18 XV. COVENANTS..............................19 XVI. DEFAULT AND TERMINATION....................... 20 XVII. RIGHTS AND DUTIES OF PARTIES UPON EXPIRATION OR TERMINATION.........................", "labels": [[0, 28, "PARTY"]]}
{"id": 75, "text": "Exhibit 10.16 ENDORSEMENT AGREEMENT THIS ENDORSEMENT AGREEMENT (“Agreement”) by and between GENO AURIEMMA (“Auriemma”) and BERKSHIRE BANK, a Massachusetts savings bank with its principal place of business at 24 North Street, Pittsfield, MA 01210 (“Berkshire”)(Each or both of which shall hereinafter be referred to as the “PARTY” or “PARTIES,” respectively). RECITALS: Berkshire desires to obtain the right to use the name, likeness, and endorsement services of Auriemma in connection with the advertisement and promotion of Berkshire’s Financial Services (as defined below). The endorsement by Auriemma of Berkshire is of commercial value. Berkshire and Auriemma wish to enter into an agreement to cooperate and coordinate the marketing of Auriemma’s endorsement with Berkshire’s banking services. NOW, THEREFORE for and in consideration of the foregoing, and the mutual covenants and agreements set forth herein, the Parties hereby agree as follows: 1. DEFINITIONS. The following terms shall be def", "labels": [[14, 35, "DOC_NAME"], [41, 62, "DOC_NAME"], [92, 105, "PARTY"], [97, 105, "PARTY"], [108, 116, "PARTY"], [123, 137, "PARTY"], [248, 257, "PARTY"], [369, 378, "PARTY"], [462, 470, "PARTY"], [525, 534, "PARTY"], [595, 603, "PARTY"], [607, 616, "PARTY"], [641, 650, "PARTY"], [655, 663, "PARTY"], [741, 749, "PARTY"]]}
{"id": 77, "text": "Exhibit 10.14 EXECUTION VERSION [*] Certain confidential information contained in this document, marked by brackets, has been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 406 of the Securities Act of 1933, as amended. MASTER OPERATION AND MAINTENANCE AGREEMENT by and between DIAMOND STATE GENERATION PARTNERS, LLC and BLOOM ENERGY CORPORATION dated as of April 13, 2012 Source: BLOOM ENERGY CORP, DRS/A (on S-1), 3/21/2018 TABLE OF CONTENTS Page ARTICLE 1 DEFINITIONS 2 Section 1.1 Definitions 2 Section 1.2 Other Definitional Provisions 11 ARTICLE 2 SYSTEM SERVICES 12 Section 2.1 In General 12 Section 2.2 Operation and Maintenance Services 12 Section 2.3 Service Fees 13 Section 2.4 System Services Warranty 13 Section 2.5 System Service Warranty Claims 13 Section 2.6 Performance Warranty 14 Section 2.7 Efficiency Warranty 14 Section 2.8 Gas Payment Shortfall 15 Section 2.9 Exclusions 15 Section 2.10 No Duplication of Terms 16 Section 2.11 Title 1", "labels": [[121, 123, "PARTY"], [263, 305, "DOC_NAME"], [313, 315, "PARTY"], [321, 359, "PARTY"], [364, 388, "PARTY"]]}
{"id": 83, "text": "Exhibit 10.20 Pages where confidential treatment has been requested are stamped ‘Confidential Treatment Requested and the Redacted Material has been separately filed with the Commission,’ and the confidential section has been marked as follows: [*]. Collaboration Agreement between Institute of Grassland and Environmental Research and Ceres, Inc. CERES-IGER Collaboration Agreement Page 1 of 75 TABLE OF CONTENTS 1. RESEARCH PROJECTS 3 2. MANAGEMENT COMMITTEE 7 3. EXCLUSIVITY 8 4. INTELLECTUAL PROPERTY 11 5. USE AND COMMERCIALIZATION RIGHTS 14 6. ENFORCEMENT OF JOINT INTELLECTUAL PROPERTY RIGHTS 16 7. CONFIDENTIALITY 16 8. PUBLICATIONS 18 9. PUBLICITY 18 10. RECORDS AND AUDITS 19 11. INDEPENDENT CONTRACTOR 19 12. CONVENTION ON BIOLOGICAL DIVERSITY 19 13. WARRANTIES 20 14. TERM AND TERMINATION 23 15. DISPUTE RESOLUTION AND APPLICABLE LAW 25 16. NOTICES 26 17. GENERAL 27 18. SPECIAL CONDITIONS IN CONNECTION WITH DEFRA AGREEMENT NF 0426 28 EXHIBIT A 30 DEFINITION OF COLLABORATION CROPS 30 EX", "labels": [[250, 273, "DOC_NAME"], [282, 331, "PARTY"], [336, 347, "PARTY"], [348, 353, "PARTY"], [354, 358, "PARTY"]]}
{"id": 98, "text": "SCHEDULE TO Software License, Customization and Maintenance Agreement Supplier Name: Cardlytics, Inc. Agreement Number: CW251207 Supplier Address: 621 North Avenue NE Suite C-30 Atlanta, GA 30308 Addendum Number: CW255039 Supplier Telephone: 888.798.5802 Addendum Effective Date March 3, 2011 This Schedule (“Schedule”) is made as of the effective date set forth above to that Software License, Customization, and Maintenance Agreement, by and between Cardlytics, Inc. (“Supplier”) and Bank of America, N. A, (“Bank of America”), dated November 5, 2010, as amended (“SLCMA”). Each capitalized term used but not defined herein shall have the meaning assigned in the SLCMA. WHEREAS, Bank of America and Supplier entered into the SLCMA in order to set forth the terms and conditions pursuant to which Supplier provides certain Software to Bank of America, WHEREAS, the parties desire to add to the SLCMA the Supplier Offer Placement System Software; NOW THEREFORE, in consideration of the promises and a", "labels": [[0, 69, "DOC_NAME"], [70, 78, "PARTY"], [85, 101, "PARTY"], [129, 137, "PARTY"], [222, 230, "PARTY"], [452, 468, "PARTY"], [471, 479, "PARTY"], [486, 507, "PARTY"], [511, 526, "PARTY"], [681, 696, "PARTY"], [701, 709, "PARTY"], [798, 806, "PARTY"], [836, 851, "PARTY"]]}
{"id": 101, "text": "Exhibit 10.4 INTELLECTUAL PROPERTY AGREEMENT by and between Nuance Communications, Inc. and Cerence Inc. Dated as of September 30, 2019 Source: CERENCE INC., 8-K, 10/2/2019 TABLE OF CONTENTS Page ARTICLE I DEFINITIONS Section 1.01. Definitions 1 ARTICLE II RECORDATION OF INTELLECTUAL PROPERTY RIGHTS ASSIGNMENT AGREEMENTS Section 2.01. Intellectual Property Assignment Agreements 5 Section 2.02. Recordation 5 Section 2.03. Security Interests 5 ARTICLE III LICENSES AND COVENANTS FROM NUANCE TO SPINCO Section 3.01. License Grants 6 Section 3.02. Other Covenants 7 ARTICLE IV LICENSES AND COVENANTS FROM SPINCO TO NUANCE Section 4.01. License Grants 8 Section 4.02. Other Covenants 9 ARTICLE V ADDITIONAL INTELLECTUAL PROPERTY RELATED MATTERS Section 5.01. Ownership 10 Section 5.02. Assignments and Licenses 10 Section 5.03. No Implied Rights 10 Section 5.04. No Obligation To Prosecute or Maintain Patents 10 Section 5.05. No Technical Assistance 10 Section 5.06. Group Members 10 ARTICLE VI CONFI", "labels": [[60, 87, "PARTY"], [92, 104, "PARTY"], [117, 135, "AGMT_DATE"], [144, 156, "PARTY"], [486, 492, "PARTY"], [496, 502, "PARTY"], [605, 611, "PARTY"]]}
{"id": 106, "text": "Exhibit 10.29 Confidential Execution Version [*] Certain information in this document has been excluded pursuant to Regulation S-K, Item 601(b)(10). Such excluded information is not material and would likely cause competitive harm to the registrant if publicly disclosed. NOV 02, 2019 BIOEQ IP AG AND COHERUS BIOSCIENCES, INC. LICENSE AND DEVELOPMENT AGREEMENT Source: COHERUS BIOSCIENCES, INC., 10-K, 2/27/2020 Confidential Execution Version CONTENTS Clause Page 1. DEFINITIONS AND INTERPRETATION1 2. LICENSE GRANT10 3. DEVELOPMENT11 4. REGULATORY ACTIVITIES14 5. MANUFACTURING AND SUPPLY17 6. COMMERCIALIZATION18 7. FINANCIAL PROVISIONS20 8. TAXATION23 9. INTELLECTUAL PROPERTY24 10. COVENANTS RELATING TO THE [*] AGREEMENT30 11. CONFIDENTIALITY30 12. REPRESENTATIONS, WARRANTIES AND COVENANTS32 13. INDEMNIFICATION AND LIMITATION OF LIABILITY34 14. GOVERNANCE35 15. TERM AND TERMINATION; NON-SOLICITATION37 16. GENERAL PROVISIONS43 Schedules Annex 1: [*] Agreement Annex 2: Term Sheet for Manufact", "labels": [[285, 296, "PARTY"], [301, 326, "PARTY"], [327, 360, "DOC_NAME"]]}
{"id": 107, "text": "Exhibit 10.1 CERTAIN CONFIDENTIAL PORTIONS OF THIS EXHIBIT WERE OMITTED AND REPLACED WITH “[*]”. A COMPLETE VERSION OF THIS EXHIBIT HAS BEEN FILED SEPARATELY WITH THE SECRETARY OF THE SECURITIES AND EXCHANGE COMMISSION PURSUANT TO AN APPLICATION REQUESTING CONFIDENTIAL TREATMENT PURSUANT TO RULE 24B-2 PROMULGATED UNDER THE SECURITIES EXCHANGE ACT OF 1934, AS AMENDED. AMENDMENT NO. 2 TO MANUFACTURING AND SUPPLY AGREEMENT THIS AMENDMENT NO. 2 (this “Amendment”) to the Manufacturing and Supply Agreement dated as of December 8, 2009 (as amended by an amendment agreement dated 31 December 2013) (the “Existing Agreement”), by and between Columbia Laboratories, (Bermuda) Ltd., a limited company existing and organised under the laws of Bermuda, having a place of business at Canon’s Court, 22 Victoria Street, Hamilton HM12, Bermuda (“Columbia”), and Fleet Laboratories Limited, a limited private company existing and organised under the laws of England, having a place of business at 94 Rickmanswo", "labels": [[370, 423, "DOC_NAME"], [640, 677, "PARTY"], [837, 845, "PARTY"], [853, 879, "PARTY"]]}
{"id": 109, "text": "Exhibit 10.33 Last Updated: April 6, 2007 CHASE AFFILIATE AGREEMENT THIS AGREEMENT sets forth the terms and conditions agreed to between Chase Bank USA, N.A. (?Chase?) and you as an “Affiliate” in the Chase Affiliate Program (the “Affiliate Program”). Once accepted into the Affiliate Program, an Affiliate can establish links from the Affiliate’s Website to [Chase.com]. Chase will pay Affiliate a fee for each approved credit card account that originates from a link in Affiliate’s Website. THIS IS A LEGAL AND CONTRACTUALLY BINDING AGREEMENT BETWEEN AFFILIATE AND CHASE. TO APPLY TO THE AFFILIATE PROGRAM, YOU MUST COMPLETE AND SUBMIT THE AFFILIATE REGISTRATION FORM AND CLICK ON THE “AGREE” BUTTON BELOW TO INDICATE YOUR WILLINGNESS TO BE BOUND TO CHASE BY THIS AGREEMENT. THIS AGREEMENT WILL TAKE EFFECT IF AND WHEN CHASE REVIEWS AND ACCEPTS YOUR REGISTRATION FORM AND PROVIDES YOU NOTICE OF ACCEPTANCE. BY SUBMITTING YOUR REGISTRATION FORM, AFFILIATE CERTIFIES THAT YOU HAVE READ AND UNDERSTAND", "labels": [[28, 41, "AGMT_DATE"], [42, 67, "DOC_NAME"]]}
{"id": 114, "text": "1 Exhibit 10.17 Confidential Materials omitted and filed separately with the Securities and Exchange Commission. Asterisks denote omissions. OUTSOURCING AGREEMENT BETWEEN: MODUS MEDIA INTERNATIONAL LANDDROSTLAAN 51 7327 GM APELDOORN THE NETHERLANDS (HEREINAFTER \"MMI\") AND DRAGON SYSTEMS, INC. 320 NEVADA STREET NEWTON, MA 02160 U.S.A. (HEREAFTER \"DRAGON SYSTEMS\") EFFECTIVE AS OF (EFFECTIVE DATE) 1. PURPOSE OF AGREEMENT Formalize the agreements made regarding services and products between Dragon Systems and MMI. 2. SERVICES MMI will produce products for Dragon Systems on a Turnkey basis. Initially, services will cover 3 products, as per the attached price sheets. However, this may be extended. Specific services will be: - - Receipt and Management of master materials - - Supply base management - - Production (both components & finished goods) - - Delivery - - Inventory Management - - Financial Services Quality and Services Level Agreements will be based on mutual agreement. 3. DELIVERY MM", "labels": [[103, 106, "PARTY"], [141, 162, "DOC_NAME"], [172, 197, "PARTY"], [263, 266, "PARTY"], [273, 293, "PARTY"], [348, 362, "PARTY"], [492, 506, "PARTY"], [511, 514, "PARTY"], [528, 531, "PARTY"]]}
{"id": 120, "text": "Exhibit 10.9 CONTENT LICENSING AGREEMENT between Data Call Technologies, Inc. 600 Kenrick, Suite B-12 Houston, Texas 77060 hereinafter referred to as \"Licensor\" and PLAN B MEDIA AG Schaafenstr. 25 50676 Cologne Germany hereinafter referred to as \"plan b\" 1 PURPOSE OF THE AGREEMENT 1.1 The purpose of this content distribution Agreement (hereinafter \"Agreement\") is to set forth the terms and conditions under which plan b may use the Content (\"Content\" as set forth in APPENDIX 2) owned or licensed by LICENSOR for a commercial distribution to plan b's End Users in the territory (\"Territory\" as set forth in APPENDIX 2). 1.2 End User means any third Party receiving Content on a mobile device for a payment in accordance with the terms and conditions of this Agreement for their own private and non- commercial use. 2 OBLIGATIONS OF LICENSOR 2.1 LICENSOR shall make a first delivery of Content to plan b within 14 days after the signing of this Agreement unless separately agreed between the Partie", "labels": [[13, 40, "DOC_NAME"], [49, 77, "PARTY"], [151, 159, "PARTY"], [165, 180, "PARTY"], [247, 253, "PARTY"], [416, 422, "PARTY"], [503, 511, "PARTY"], [545, 551, "PARTY"], [835, 843, "PARTY"], [848, 856, "PARTY"]]}
{"id": 124, "text": "Exhibit 10.21 Confidential treatment has been requested for portions of this exhibit. The copy filed herewith omits the information subject to the confidentiality request. Omissions are designated as [*]. A complete version of this exhibit has been filed separately with the Securities and Exchange Commission. Network Management Outsourcing Agreement Bank of South Pacific Ltd Network Management Outsourcing Agreement Datec Contact Details [*] [*] [*] [*] [*] [*] [*] [*] [*] [*] Commercial in Confidence Page 2 May 2004 Network Management Outsourcing Agreement * CONFIDENTIAL TREATMENT REQUESTED Bank Of South Pacific Ltd Document outline prepared by Des Kearse: Datec PNG Ltd May 2004 Document Distribution, Approval and Revision History Distribution This document has been distributed to Name Title-Company [*] [*] [*] [*] [*] [*] [*] Approvals This document requires the following approvals. Signed approval forms are filed in the Quality section of the Bank of South Pacific Limited and Datec P", "labels": [[311, 351, "DOC_NAME"], [352, 377, "PARTY"], [378, 418, "DOC_NAME"], [419, 424, "PARTY"], [522, 562, "DOC_NAME"], [598, 623, "PARTY"], [665, 670, "PARTY"], [671, 674, "PARTY"], [959, 988, "PARTY"]]}
{"id": 132, "text": "Exhibit 10.5 STRATEGIC ALLIANCE AGREEMENT THIS STRATEGIC ALLIANCE AGREEMENT (this \"Agreement\") is made as of 31 December, 1996, between NORTHERN TELECOM LIMITED, a Canadian corporation (\"NTL\"), and ENTRUST TECHNOLOGIES INC., a Maryland corporation (\"ETI\"). WHEREAS, pursuant to an asset transfer agreement between NTL and Entrust Technologies Limited of even date (the \"NTL Transfer Agreement\") and an asset transfer agreement between Northern Telecom Inc. and ETI of even date, the Entrust Technology (as defined herein) has been transferred to ETI and ETI's Canadian subsidiary, Entrust Technologies Limited; and WHEREAS, NTL desires to license from Entrust on behalf of itself and the Nortel Subsidiaries (as defined herein) ongoing rights to the Entrust Technology, ETI desires to license from NTL on behalf of itself and its Subsidiaries some intellectual property rights associated with the Entrust Technology, and NTL and ETI desire to cooperate regarding contracting, patent cross-licensing a", "labels": [[13, 41, "DOC_NAME"], [47, 75, "DOC_NAME"], [136, 160, "PARTY"], [187, 190, "PARTY"], [198, 223, "PARTY"], [250, 253, "PARTY"], [314, 317, "PARTY"], [370, 373, "PARTY"], [461, 464, "PARTY"], [546, 549, "PARTY"], [554, 557, "PARTY"], [624, 627, "PARTY"], [770, 773, "PARTY"], [798, 801, "PARTY"], [921, 924, "PARTY"]]}
{"id": 133, "text": "EXHIBIT 10.8 DISTRIBUTOR AGREEMENT Tripath Technology, Inc. 3900 Freedom Circle Suite # 200 Santa Clara, CA 95054 Tel: (408) 567-3000 Fax: (408) 567-3003 This Agreement is effective 7/1/98 (“Effective Date”) between Tripath Technology, Inc. (“Tripath”), and Uniquest Corporation 780 Montague Expressway Suite 406 Santa Jose, CA 95131 Tripath and Distributor intend to establish Distributor as a non-exclusive Distributor for Tripath products in the following designated Territory, subject to the terms and conditions of this Agreement. Korea 1. Products 1.1 “Products” means the Tripath semiconductor products identified by Tripath in writing from time to time. 1.2 Tripath may discontinue manufacture or sale, or otherwise treat as obsolete, any or all of the Products covered by this Agreement upon thirty days written notice. 2. Appointment and Term 2.1 For the term of this Agreement, Tripath appoints Distributor as a non-exclusive distributor for the Products in the Territory, subject to Tripa", "labels": [[13, 34, "DOC_NAME"], [35, 59, "PARTY"], [216, 240, "PARTY"], [243, 250, "PARTY"], [258, 278, "PARTY"], [334, 341, "PARTY"], [346, 357, "PARTY"], [378, 389, "PARTY"], [409, 420, "PARTY"], [425, 432, "PARTY"], [579, 586, "PARTY"], [624, 631, "PARTY"], [666, 673, "PARTY"], [889, 896, "PARTY"], [906, 917, "PARTY"]]}
{"id": 151, "text": "[ * ] = Certain confidential information contained in this document, marked by brackets, has been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 406 of the Securities Act of 1933, as amended. Exhibit 10.11 COLLABORATION AGREEMENT BY AND BETWEEN ASTELLAS PHARMA INC. AND FIBROGEN, INC. June 1, 2005 CONFIDENTIAL EXECUTION COPY TABLE OF CONTENTS ARTICLE 1 DEFINITIONS 1 1.1 “Actions” 1 1.2 “Affiliate” 1 1.3 “Astellas Indemnitees” 1 1.4 “Astellas Territory” 1 1.5 “Authorized Designee” 1 1.6 “Bridging Strategy” 1 1.7 “Bulk Product” 2 1.8 “Commercialize” 2 1.9 “Completion” 2 1.10 “Confidential Information” 2 1.11 “Control” or “Controlled” 2 1.12 “Controlling Party” 2 1.13 “Data” 2 1.14 “Delivery” or “Delivered” 2 1.15 “Development Plan” 2 1.16 “Development Program” 2 1.17 “Enforcement Action” 2 1.18 “Event” 2 1.19 “Expanded Field” 2 1.20 “Expenses” 2 1.21 “FDA” 2 1.22 “FG Acquired Patents” 3 1.23 “FG Development Program” 3 1.24 “FG Indemnitees” 3 1.25", "labels": [[288, 308, "PARTY"], [313, 327, "PARTY"], [328, 340, "AGMT_DATE"], [450, 458, "PARTY"]]}
{"id": 152, "text": "EXHIBIT 10.3 INTELLECTUAL PROPERTY AGREEMENT BETWEEN EQUIFAX INC. AND CERTEGY INC. JUNE 30, 2001 TABLE OF CONTENTS ARTICLE I DEFINITIONS............................................................................... 3 Section 1.1. Definitions..................................................................... 3 ARTICLE II CONVEYANCE OF CERTAIN ASSETS; ASSUMPTION OF CERTAIN LIABILITIES.......................... 8 Section 2.1. Transferred Equifax Assets...................................................... 8 Section 2.2. Transferred Certegy Assets...................................................... 8 Section 2.3. Assumption of Liabilities....................................................... 9 Section 2.4. Completion of Transactions...................................................... 9 ARTICLE III THIRD PARTY AGREEMENTS.................................................................. 10 Section 3.1. Third Party Agreements.......................................................... 1", "labels": [[13, 44, "DOC_NAME"], [53, 65, "PARTY"], [70, 82, "PARTY"]]}
{"id": 160, "text": "EXHIBIT 10.1 JOINT DEVELOPMENT AGREEMENT between FUELCELL ENERGY, INC. and EXXONMOBIL RESEARCH AND ENGINEERING COMPANY Source: FUELCELL ENERGY INC, 8-K, 11/6/2019 TABLE OF CONTENTS ARTICLE 1 - DEFINITIONS 1 ARTICLE 2 - PROGRAM 1 ARTICLE 3 - PROGRAM GOVERNANCE 2 ARTICLE 4 - DISCLOSURE, CONFIDENTIALITY AND RESTRICTED USE 3 ARTICLE 5 - PUBLICITY AND PUBLICATIONS 5 ARTICLE 6 - OWNERSHIP / PROCUREMENT OF PROGRAM RESULTS 6 ARTICLE 7 -LICENSE TO PROGRAM RESULTS 7 ARTICLE 8 - LICENSE TO BACKGROUND INFORMATION AND PATENTS 8 ARTICLE 9 - INFRINGEMENT OF THIRD PARTY PATENTS 11 ARTICLE 10 - PAYMENT 11 ARTICLE 11 - REPRESENTATIONS, WARRANTIES, INDEMNITIES AND LIABILITIES 13 ARTICLE 12 - TERM AND TERMINATION 14 ARTICLE 13 - ARBITRATION AND GOVERNING LAW 17 ARTICLE 14 - ASSIGNMENT 18 ARTICLE 15 - FORCE MAJEURE 18 ARTICLE 16 - ADDRESSES AND NOTICES 18 ARTICLE 17 - COMPLIANCE 19 ARTICLE 18 - RECORDS AND AUDIT 20 ARTICLE 19 - TAXES 20 ARTICLE 20 - ADDITIONAL PROVISIONS 20 APPENDIX A - DEFINITIONS 24 APPE", "labels": [[13, 40, "DOC_NAME"], [49, 70, "PARTY"], [75, 118, "PARTY"]]}
{"id": 164, "text": "EXHIBIT 10.46 WEB HOSTING AGREEMENT This agreement shall void and nullify any and all previous agreements to this date between Galacticomm and Horst Entertainment Inc. There shall be no additional fees of any kind paid to Galaticomm, other than those stated within this agreement for software usage and/or bandwidth usage. Horst Entertainment agrees to pay Galactcomm $0.01 (one cent) per access up to 400,000 accesses thereafter payment shall be $0.005 (one-half cent) per access. Horst Entertainment shall send this amount to Galacticomm by no later than Wednesday for accesses used from the previuos week (Monday thru Sunday). Galacticomm must provide a person(s) to correct any technical problems (Server being down or inaccessible) 24 hours per day, 7 days per week. This person(s) must be available by beeper or telephone. Horst Entertainment shall provide this same 24 hour service at the broadcast location. In the event Galacticomm, Inc. chooses to terminate this agreement, Horst Entertainm", "labels": [[14, 35, "DOC_NAME"], [127, 138, "PARTY"], [143, 166, "PARTY"], [528, 539, "PARTY"], [630, 641, "PARTY"]]}
{"id": 165, "text": "Exhibit A JOINT FILING AGREEMENT Pursuant to and in accordance with the Securities Exchange Act of 1934, as amended, and the rules and regulations thereunder (the “Exchange Act”) the undersigned hereby agree to the joint filing of Clarus IV-A, L.P., Clarus IV-B, L.P., Clarus IV-C, L.P., Clarus IV-D, L.P., Clarus IV GP, L.P., Blackstone Clarus GP L.P., Blackstone Clarus GP L.L.C., Blackstone Holdings II L.P., Blackstone Holdings I/II GP L.L.C., The Blackstone Group Inc., Blackstone Group Management L.L.C. and Stephen A. Schwarzman, on behalf of each of them of any filing required by such party under Section 13 of the Exchange Act or any rule or regulation thereunder (including any amendment, restatement, supplement, and/or exhibit thereto) with respect to securities of Galera Therapeutics, Inc., a Delaware corporation, and further agree to the filing, furnishing, and/or incorporation by reference of this Agreement as an exhibit thereto. Each of them is responsible for the timely filing ", "labels": [[10, 32, "DOC_NAME"], [231, 248, "PARTY"], [250, 267, "PARTY"], [269, 286, "PARTY"], [288, 304, "PARTY"], [307, 325, "PARTY"], [327, 351, "PARTY"], [354, 380, "PARTY"], [383, 410, "PARTY"], [412, 446, "PARTY"], [448, 473, "PARTY"], [475, 509, "PARTY"]]}
{"id": 167, "text": "Exhibit 10.16 CONSULTING AGREEMENT This Consulting Agreement (the “Agreement”) is made and entered into as of this 2nd day of January 2020, by and between Global Technologies, Ltd (hereinafter the “Company”), a Delaware corporation whose address is 501 1st Ave N., Suite 901, St. Petersburg, FL 33701 and Timothy Cabrera (hereinafter the “Consultant”), an individual whose address is 11718 SE Federal Hwy., Suite 372, Hobe Sound, FL 33455 (individually, a “Party”; collectively, the “Parties”). This Agreement is non-exclusive. RECITALS WHEREAS, the Company has asked to retain Consultant to provide various services to the Company as agreed to by both parties and outlined in Section 3; and WHEREAS, the Consultant has advised the Company of its willingness and desire to provide such services as outlined in Section 3 and on the terms and conditions set forth in this Agreement. NOW, THEREFORE, in consideration of the mutual promises herein contained, the Parties hereto hereby agree as follows: 1", "labels": [[14, 34, "DOC_NAME"], [40, 60, "DOC_NAME"], [155, 179, "PARTY"], [198, 205, "PARTY"], [305, 320, "PARTY"], [339, 349, "PARTY"], [550, 557, "PARTY"], [578, 588, "PARTY"], [624, 631, "PARTY"], [705, 715, "PARTY"]]}
{"id": 171, "text": "EXHIBIT 10.6 TRANSPORTATION CONTRACT SPECIFIC CONDITIONS PURPOSE ECONOMIC CONDITIONS CONTRACTED CAPACITY POINTS OF ENTRANCE AND EXIT MANSOYÁ - TUMACO Date Bogota D.C. January 30, 2012 Contract No. VIT-005-2012 SENDER SOLANA PETROLEUM EXPLORATION COLOMBIA LIMITED TAX ID 830.051.027-8 SHIPPER ECOPETROL S.A. TAX ID 899.999.068-1 T Y P E O F CRUDE OWN PRODUCTION x PROPERTY Transportation Service of liquid hydrocarbons through the “Trasandino” Pipeline(OTA) and Mansoyá-Orito (OMO) pipeline. Estimated Value of the Contract Six millions seven hundred forty five thousand dollars of The United States of America (USD$6.745.000). Rate “Mansoyá-Orito” Pipeline (OMO) Cero point five one nine two dollars of The Untied States of America (USD$0,5192) per Barrel Rate “Trasandino” Pipeline (OTA) Three dollars eleven forty three cents of dollars of The Untied States of America (USD$3,1143) per Barrel. PRODUCT Daily Average (Barrels/calendar day) Monthly average (Barrels/month) Crude 10.000 300.000 TERM O", "labels": [[167, 183, "AGMT_DATE"], [210, 216, "PARTY"], [217, 262, "PARTY"], [284, 291, "PARTY"], [292, 306, "PARTY"]]}
{"id": 172, "text": "EXHIBIT 10.3 SUPPLY AGREEMENT This Agreement (“the Agreement”), is made by and between EWSD 1, LLC, d/b/a/ SHI FARMS (“Shi Farms”), a Delaware limited liability company and Gridiron BioNutrients, Inc, a Nevada Corporation (“Gridiron”) , each individually “a Party,” and collectively, “the Parties.” WHEREAS Shi Farms grows industrial hemp and wishes to sell hemp biomass (“Product”); and Gridiron wishes to purchase Product from Shi Farms; and Both Parties acknowledge that Shi Farms is the owner of the Product as defined below; and Shi Farms is willing to sell Product to Gridiron and Gridiron desires to acquire in accordance with the terms and conditions set forth below. NOW, THEREFORE for good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged, the Parties agree as follows: 1. Products and Payments A. Product. Shi Farms agrees to sell Product and Gridiron agrees to purchase 30,000 lbs. of hemp biomass (“Biomass”) from Shi Farms. Biomass must contain a", "labels": [[13, 29, "DOC_NAME"], [87, 116, "PARTY"], [107, 116, "PARTY"], [119, 128, "PARTY"], [173, 199, "PARTY"], [224, 232, "PARTY"], [307, 316, "PARTY"], [388, 396, "PARTY"], [429, 438, "PARTY"], [474, 483, "PARTY"], [534, 543, "PARTY"], [574, 582, "PARTY"], [587, 595, "PARTY"], [857, 866, "PARTY"], [894, 902, "PARTY"]]}
{"id": 175, "text": "EXHIBIT 4 AFFILIATE AGREEMENT Physician Sales & Service, Inc. 4345 Southpoint Boulevard Jacksonville, Florida 32216 Attention: Patrick C. Kelly David A. Smith Gentlemen: The undersigned is a shareholder of Gulf South Medical Supply, Inc. (\"GSMS\"), a corporation organized and existing under the laws of the State of Delaware, and will become a shareholder of Physician Sales & Service, Inc. (\"PSS\"), a corporation organized and existing under the laws of the State of Florida, pursuant to the transactions described in the Agreement and Plan of Merger, dated as of December 14, 1997 (the \"Agreement\"), by and among PSS, PSS Merger Corp. (\"Merger Corp.\") and GSMS. Under the terms of the Agreement, Merger Corp. will be merged into and with GSMS (the \"Merger\"), and the shares of the $.01 par value common stock of GSMS (\"GSMS Common Stock\") will be converted into and exchanged for shares of the $.01 par value common stock of PSS (\"PSS Common Stock\"). This Affiliate Agreement represents an agreemen", "labels": [[10, 29, "DOC_NAME"], [30, 61, "PARTY"], [206, 237, "PARTY"], [240, 244, "PARTY"], [359, 390, "PARTY"], [393, 396, "PARTY"], [615, 618, "PARTY"], [620, 636, "PARTY"], [658, 662, "PARTY"], [740, 744, "PARTY"], [814, 818, "PARTY"], [821, 825, "PARTY"], [927, 930, "PARTY"], [933, 936, "PARTY"]]}
{"id": 177, "text": "Table of Contents EXECUTION VERSION Exhibit 2.4 INTELLECTUAL PROPERTY AGREEMENT by and between HONEYWELL INTERNATIONAL INC. and GARRETT MOTION INC. Dated as of September 27, 2018 Source: GARRETT MOTION INC., 8-K, 10/1/2018 Table of Contents TABLE OF CONTENTS Page ARTICLE I DEFINITIONS Section 1.01. Definitions 1 ARTICLE II RECORDATION OF INTELLECTUAL PROPERTY RIGHTS ASSIGNMENT AGREEMENTS Section 2.01. Intellectual Property Assignment Agreements 4 Section 2.02. Recordation 4 Section 2.03. Security Interests 4 ARTICLE III LICENSES AND COVENANTS FROM HONEYWELL TO SPINCO Section 3.01. License Grants 4 Section 3.02. Other Covenants 5 Section 3.03. Honeywell Content 6 ARTICLE IV LICENSES AND COVENANTS FROM SPINCO TO HONEYWELL Section 4.01. License Grants 7 Section 4.02. Other Covenants 7 ARTICLE V ADDITIONAL INTELLECTUAL PROPERTY RELATED MATTERS Section 5.01. Assignments and Licenses 8 Section 5.02. No Implied Licenses 9 Section 5.03. No Obligation To Prosecute or Maintain Patents 9 Section ", "labels": [[95, 123, "PARTY"], [128, 147, "PARTY"], [160, 178, "AGMT_DATE"], [187, 206, "PARTY"], [554, 563, "PARTY"], [567, 573, "PARTY"], [651, 660, "PARTY"], [710, 716, "PARTY"]]}
{"id": 179, "text": "EXHIBIT 10.9 GLOBAL MUSIC INTERNATIONAL, INC. DBA IMNTV CONTENT LICENSE AGREEMENT This Content License Agreement (“Agreement”) is between Global Music International, Inc. d/b/a Independent Music Network (IMNTV), located at 20 Old Stagecoach Road, Redding, Connecticut, 06896 (“IMNTV”), and Distributor, as set forth below, and describes the terms and conditions under which Distributor will distribute Programming provided by IMNTV as described herein. Distributor’s distribution of the Programming is subject to the Master Terms of Service (“MTS”) attached hereto as Exhibit A. All capitalized terms shall have the meaning set forth on the MTS. In consideration for the mutual promises and covenants contained herein, the parties agree as follows: Distributor’s authorized signature, is REQUIRED: A. Distributor Information N/A Provider Name: MobileVision Communications Ltd. Address: 100 Ba Li Zhuang Xi Li, Suite 907, ZhuBang2000 Plaza, East Building, Beijing, China COUNTRY PROVINCE: P.R.China We", "labels": [[50, 55, "PARTY"], [56, 81, "DOC_NAME"], [87, 112, "DOC_NAME"], [138, 202, "PARTY"], [204, 209, "PARTY"], [277, 282, "PARTY"], [290, 301, "PARTY"], [374, 385, "PARTY"], [426, 431, "PARTY"], [453, 464, "PARTY"], [749, 760, "PARTY"], [801, 812, "PARTY"]]}
{"id": 193, "text": "Exhibit 10.1 Sales, Marketing, Distribution, and Supply Agreement {*} WHEREAS HEMISPHERX is a biopharmaceutical company with headquarters at One Penn Center, 1617 JFK Boulevard, Suite 500, Philadelphia, PA 19103, U.S. (\"HEMISPHERX\") and Scientific Products Pharmaceutical Co. LTD is a pharmaceutical company with its primary offices located at Tahlia Street, P.O Box 10485, Riyadh 11433 Saudi Arabia (\" SCIEN”), each a “Party” together, “Parties”, and WHEREAS HEMISPHERX owns intellectual proprietary rights relating to Interferon alfa-n3 (human leukocyte derived), and WHEREAS HEMISPHERX desires to have Interferon alfa-n3 (human leukocyte derived) provided to physicians to treat genital warts and other infections and diseases, including MERS, in the GCC (Gulf Cooperation Council) states , as appropriate, prior to regulatory approval in such countries and to have Interferon alfa-n3 (human leukocyte derived) approved by the regulatory authorities in each GCC country (Kingdom of Saudi Arabia, B", "labels": [[13, 65, "DOC_NAME"], [78, 88, "PARTY"], [220, 230, "PARTY"], [237, 279, "PARTY"], [403, 408, "PARTY"], [460, 470, "PARTY"]]}
{"id": 197, "text": "COOPERATION AGREEMENT made by and between HPIL ENERGYTECH Inc. and GINARES GROUP AG January 5, 2015 Table of Contents 1. Term........................................................................................................................................... 2 2. Goals And Objectives................................................................................................................ 2 3. Obligations Of The Parties........................................................................................................ 3 4. Confidentiality........................................................................................................................... 3 5. Relation Of The Parties............................................................................................................. 3 6. Closing....................................................................................................................................... 3 7. Representations, Warrantie", "labels": [[0, 21, "DOC_NAME"], [42, 62, "PARTY"], [67, 83, "PARTY"]]}
{"id": 198, "text": "PHOTO RETOUCHING OUTSOURCING AGREEMENT Between: DGT Corp. Suite 207 - 1130 Austin Avenue, Coquitlam, British Columbia, Canada V3K 3P5 (hereinafter referred to as “DGT”) And: Dolphin Industries Limited Room 1302 Golden Gate Commercial Bldg 136 Austin Road Tsimshatsui, Hong Kong (hereinafter referred to as “Dolphin”) WHEREAS: DGT is an internet provider of professional digital photo-editing services for photography studios and digital photo processors. Both parties are desirous of entering into this Agreement regarding the outsourcing of photo-editing services of DGT’s clients in the North American market place and elsewhere. NOW THEREFORE THIS AGREEMENT WITNESSETH that both parties agrees as follows: 1.DGT shall pay Dolphin USD10,000, for carrying out the beta testing of the quality of their photo-editing services and testing of the Internet bandwidth for file transmission. This amount is to be paid in two monthly installments, USD5,000 on the date of this Agreement and USD5,000, 30 day", "labels": [[0, 38, "DOC_NAME"], [48, 57, "PARTY"], [163, 166, "PARTY"], [174, 200, "PARTY"], [307, 314, "PARTY"], [326, 329, "PARTY"], [568, 571, "PARTY"], [711, 714, "PARTY"]]}
{"id": 208, "text": "Exhibit 10.39 English Translation Jiangsu Telecom Contract No.: JSXCS1200166CC000 Cooperation Agreement on Mobile Game Business Between Dazzle Interactive Network Technologies Co., Ltd. And Shenzhen iDreamSky Technology Co., Ltd. Party A: Dazzle Interactive Network Technologies Co., Ltd. Address: 4F, Han Zhong Hua Mansion, 268 Han Zhong Road, Gu Lou District, Nanjing Zip code: 210001 Contact person: Chen Xi Tel: Name of account: Dazzle Interactive Network Technologies Co., Ltd Deposit Bank: China Merchants Bank, Chengbei Sub-branch, Nanjing A/C: Party B: Shenzhen iDreamSky Technology Co., Ltd. Address: 7F, EVOC Technology Building, No. 31 Gaoxin Central 4th Road, Nanshan District, Shenzhen Zip code: 518057 Contact person: Chen Zhiyu Contact Tel: Name of account: Shenzhen iDreamSky Technology Co., Ltd. Deposit Bank: China Merchants Bank Co., Ltd., CMB Shenzhen Sungang Sub-branch A/C: Page 1 of 29 Jiangsu Telecom Contract No.: JSXCS1200166CC000 In order to provide Party A’s users with be", "labels": [[82, 103, "DOC_NAME"], [136, 184, "PARTY"], [190, 229, "PARTY"], [230, 237, "PARTY"], [239, 287, "PARTY"], [433, 481, "PARTY"], [552, 559, "PARTY"], [561, 600, "PARTY"], [773, 812, "PARTY"]]}
{"id": 209, "text": "Exhibit 1 Execution Copy JOINT VENTURE AGREEMENT BETWEEN TATE & LYLE FERMENTATION PRODUCTS LTD. AND IGENE BIOTECHNOLOGY, INC. Table of Contents 1. 2. DEFINITIONS CREATION OF THE JOINT VENTURE AND ITS STRUCTURE Page 1 4 3. 4. PARTIES' CONTRIBUTIONS TO THE JOINT VENTURE AND FINANCING PARTIES' INTERESTS IN THE JOINT VENTURE 4 6 5. 6. [INTENTIONALLY OMITTED] TAX CONSIDERATIONS 6 6 7. 8. PARTIES' WITHDRAWAL FROM THE FIELD OF AGREEMENT FUTURE PRODUCTS AND DEVELOPMENTS 8 8 9. 10. MANAGEMENT AND CONTROL OF THE JOINT VENTURE DAY-TO-DAY MANAGEMENT OF THE JOINT VENTURE 10 12 11. SERVICES TO BE PROVIDED TO THE JOINT VENTURE BY THE PARTIES 12 12. RIGHT OF FIRST REFUSAL; TERMINATION OF THE JOINT VENTURE AFTER THE EFFECTIVE DATE 14 13. LIABILITIES 15 14. WARRANTIES BY THE PARTIES 16 15. CONDITIONS PRECEDENT; TERMINATION OF AGREEMENT 17 16. OPERATIONS UNTIL TRANSFER 18 17. ASSIGNMENT; PLEDGE OF JOINT VENTURE INTEREST 19 18. COSTS, FEES AND TAXES 19 19. NOTICES 19 20. LAW 20 21. MISCELLANEOUS PROVISION", "labels": [[25, 48, "DOC_NAME"], [57, 95, "PARTY"]]}
{"id": 210, "text": "MAINTENANCE AGREEMENT BETWEEN XIMAGE AND SAGEM S.A., DEPARTEMENT MORPHO SYSTEMES Page 1 TABLE OF CONTENTS 1. Definitions...................................................................3 2. Term of Agreement.............................................................4 3. Software Maintenance Services.................................................4 4. Performance of Services.......................................................4 5. Customer Obligations and Warranties...........................................5 6. Charges.......................................................................5 7. Non disclosure................................................................5 8. Response by XIMAGE............................................................6 9. Intervention on site..........................................................6 10. Return and Repair.............................................................7 11. Injunctive Relief/Termination..............................", "labels": [[0, 21, "DOC_NAME"], [30, 36, "PARTY"], [41, 51, "PARTY"], [65, 71, "PARTY"]]}
{"id": 211, "text": "CERTAIN IDENTIFIED INFORMATION HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS NOT MATERIAL AND WOULD LIKELY CAUSE COMPETITIVE HARM TO THE REGISTRANT IF PUBLICLY DISCLOSED. [*] INDICATES THAT INFORMATION HAS BEEN REDACTED. PROMOTION AGREEMENT by and between JANSSEN BIOTECH, INC. and IMMUNOMEDICS, INC. Dated as of: April 5, 2019 TABLE OF CONTENTS ARTICLE 1 DEFINITIONS 1 ARTICLE II BRAND PLAN 10 2.1 Brand Plan Generally 10 2.2 Contents of Brand Plan 10 ARTICLE III PROMOTION 12 3.1 Scope 12 3.2 Detailing Requirements 13 3.3 Sales Representatives 14 3.4 Promotional Materials 15 3.5 Product Sales 16 3.6 Product Recall 16 3.7 Product Return 17 ARTICLE IV GOVERNANCE 17 4.1 Authority 17 4.2 Joint Commercial Team 17 4.3 BALVERSA Sales Advisory Team 18 ARTICLE V COMPENSATION 18 5.1 Definitions 18 5.2 Service Fees 18 5.3 Milestones 19 5.4 Costs 20 5.5 Reports and Payments 20 ARTICLE VI REGULATORY MATTERS 21 6.1 Regulatory Approvals 21 6.2 Pharmacovigilance Procedures 22 6.3 Product Complaints 2", "labels": [[225, 244, "DOC_NAME"], [260, 281, "PARTY"], [286, 304, "PARTY"]]}
{"id": 215, "text": "Exhibit 10.1 COLLABORATION AGREEMENT by and between THERAVANCE, INC. and GLAXO GROUP LIMITED Dated: November 14, 2002 TABLE OF CONTENTS ARTICLE 1 DEFINITIONS 1 ARTICLE 2 RIGHTS AND OBLIGATIONS 11 2.1 License Grants from Theravance to GSK 11 2.1.1 Development License 11 2.1.2 Commercialization License 11 2.1.3 Manufacturing License 11 2.2 Sublicensing and Subcontracting 11 2.3 Trademarks and Housemarks 12 2.3.1 Trademarks 12 2.3.2 Housemarks 12 2.3.3 Ownership of Inventions 12 ARTICLE 3 GOVERNANCE OF DEVELOPMENT AND COMMERCIALIZATION OF PRODUCTS 13 3.1 Joint Steering Committee 13 3.1.1 Purpose 13 3.1.2 Members; Officers 13 3.1.3 Responsibilities 13 3.1.4 Meetings 14 3.1.5 Decision-Making 14 3.2 Joint Project Committee 15 3.2.1 Purpose 15 3.2.2 Members; Officers 15 3.2.3 Responsibilities 15 3.2.4 Meetings 16 3.2.5 Decision-Making 16 3.3 Minutes of Committee Meetings 16 3.3.1 Distribution of Minutes 16 3.3.2 Review of Minutes 16 3.3.3 Discussion of Comments 16 3.4 Expenses 17 3.5 General ", "labels": [[52, 68, "PARTY"], [73, 92, "PARTY"], [220, 230, "PARTY"]]}
{"id": 223, "text": "Exhibit 10.1 NOTE: Certain information indicated with [*] in this document has been omitted from this exhibit because it is both (i) not material and (ii) would be competitively harmful if publicly disclosed. MASTER JOINT DEVELOPMENT AGREEMENT This Master Joint Development Agreement (\"Agreement\") is between iBio Inc., a Public corporation, with a location at iBio Inc., 600 Madison Ave, Suite 01601 NY, NY 10022-1735 and Beijing CC-Pharming Ltd. of Beijing, China (“CC-Pharming”), a Chinese Corporation with a location at Shunyi District, Beijing, China, 101312, each of the foregoing being individually referred to as a “Party” and collectively as the “Parties”. WHEREAS, iBio and CC-Pharming wish to establish a long-term working relationship for various joint research and development projects (“Projects”) related to the development of various products, with the work for each Project to be described in a separate Statement of Work (“SOW”) agreed by the Parties; WHEREAS, iBio has developed an", "labels": [[209, 243, "DOC_NAME"], [249, 283, "DOC_NAME"], [309, 318, "PARTY"], [361, 370, "PARTY"], [423, 447, "PARTY"], [431, 442, "PARTY"], [468, 479, "PARTY"]]}
{"id": 234, "text": "Exhibit 99.1 [*] = Certain confidential information contained in this document, marked by brackets, is filed with the Securities and Exchange Commission pursuant to Rule 24b-2 of the Securities Exchange Act of 1934, as amended. CHANNEL PARTNER RESELLER AGREEMENT THIS CHANNEL PARTNER RESELLER AGREEMENT (“Agreement”) is entered into and agreed upon as of the Effective Date by and between IPASS INC., having a principal place of business at 3800 Bridge Parkway, Redwood Shores, CA 94065 (“iPass”), and Pareteum Corporation, having a principal business address at 100 Park Avenue, Suite 1600, New York City, New York 10017 (“Channel Partner”). Capitalized terms used in this Agreement shall be defined as set forth herein. This Agreement is comprised of the Terms and Conditions together with all Exhibits attached hereto. The undersigned represent and warrant that they are authorized as representatives of the party on whose behalf they are signing this Agreement and that they have read and agree t", "labels": [[228, 262, "DOC_NAME"], [268, 302, "DOC_NAME"], [389, 399, "PARTY"], [489, 494, "PARTY"], [502, 522, "PARTY"]]}
{"id": 237, "text": "Exhibit 10.1 KALLO Inc. STRATEGIC ALLIANCE AGREEMENT MOBILECARE STRATEGIC ALLIANCE AGREEMENT - MOBILE CARE This Agreement is made by and between: KALLO Inc. With principal offices at 15 Allstate Parkway, Suite 600, Markham, ON L3R 5B4., Canada (“KALLO”) AND Petro data Management Services Limited., With principal offices at Motorways Center, Block-B, 1 Motorways Avenue Alausa, Ikeja, Lagos, Nigeria (“PDMS”) AND Gateway Global Fabrication Ltd., With principal offices at No-2 Olodu Street, Off Oluobasanjo Road, Portharcourt, Rivers state, Nigeria. (“Gateway”) As of the date set forth below. Whereas, Kallo is the developer, owner and licensor of certain Mobile Care Suite of Products packages designated as the subject matter of this Agreement: Whereas, PDMS and Gateway (Agent) desires to become a business associate of Kallo for the region of Nigeria, under the terms and conditions hereof; Now therefore, all the parties agree as follows: For the purposes of this Agreement, the following defi", "labels": [[13, 22, "PARTY"], [24, 52, "DOC_NAME"], [64, 92, "DOC_NAME"], [146, 155, "PARTY"], [246, 251, "PARTY"], [258, 297, "PARTY"], [403, 407, "PARTY"], [414, 445, "PARTY"], [553, 560, "PARTY"], [604, 609, "PARTY"], [758, 762, "PARTY"], [767, 774, "PARTY"]]}
{"id": 240, "text": "Exhibit 10.28 [*] Certain information in this document has been omitted from this exhibit because it is both (i) not material and (ii) would be competitively harmful if publicly disclosed. JOINT VENTURE AGREEMENT BETWEEN KIROMIC BIOPHARMA Inc., a Delaware Company, Fannin South Professional Building, 7707, Fannin St. Suite 140, Houston TX 77054 USA, in person of the Legal Representative of the Chief Executive Officer dr. Prof. Maurizio Chiriva Internati, PhD AND MOLIPHARMA S.R.L. an Italian Company stated in Campobasso, Via del Castello n. 3, FISCAL CODE AND VAT NUMBER: 01655870705 in person of the Legal Representative Avv. Giovanni Meliadò; each a Party and, together, the Parties. WHEREAS A. Kiromic is a Company active in the fields of: Research and development, in the field of immunotherapy, immuno-oncology, infectious diseases, cardiovascular disease, auto immune diseases, inflammatory diseases and gene editing that develops highly effective and safe immuno-therapies to address and d", "labels": [[189, 212, "DOC_NAME"], [221, 243, "PARTY"], [466, 483, "PARTY"]]}
{"id": 244, "text": "EXHIBIT ‘B’ This Exhibit B is entered into as of the 26th day of March 2020 by and between Kubient, Inc. (\"Kubient\"), and The Associated Press (\"Customer\"). This Exhibit is hereby incorporated into and made a part of the Master Services Agreement (the \"Agreement\") between the Parties (Effective Date: February 5, 2020). NATURE OF ENGAGEMENT: Customer has retained Kubient to help increase revenue from its consumer offerings, including but not limited to its websites, apps, videos, and podcasts. SERVICES: Kubient shall provide to Customer advertising and related business revenue consultation with respect to the AP News site, AP News mobile app, AP DNE sites and widgets. This includes all categories identified in the threshold table in Schedule 1 to Exhibit B. REVENUE SHARE/FEE: Commencing on March 1, 2020 and thereafter, the Parties shall share revenue generated from Customer's consumer offerings, including but not limited to its content, technology, traffic, data, websites, apps, videos ", "labels": [[49, 75, "AGMT_DATE"], [91, 104, "PARTY"], [107, 114, "PARTY"], [122, 142, "PARTY"], [145, 153, "PARTY"], [343, 351, "PARTY"], [365, 372, "PARTY"], [508, 515, "PARTY"], [533, 541, "PARTY"]]}
{"id": 248, "text": "Exhibit 10.34 INTERNET CHANNEL COOPERATION AGREEMENT Contract Number: 181015BD0120 Party A: Beijing Baidu Netcom Science and Technology Co., Ltd. Address: Baidu Building, 10 Shangdi 10 Street, Haidian District, Beijing Contact: HOU Gang Telephone: 010-59927171 Fax: 010-59920021 Party B: China Online Housing (Hong Kong) Co., Ltd. Address: 8/F, Ideal International Plaza, 58 Beisihuan Xilu, Haidian District, Beijing Contact: Telephone: 010-58951000 Fax: 010-58951005 Party C: Beijing Yisheng Leju Information Services Co., Ltd. Legal representative: ZHU Xusheng Authorized signatory: Address: 8/F, Ideal International Plaza, 58 Beisihuan Xilu, Haidian District, Beijing Contact: Telephone: 010-58951000 Fax: 010-58951005 In this Agreement, Party A, Party B and Party C individually a “Party”, collectively the “Parties”. The transaction contemplated to be jointly conducted by Party A and Party B hereunder is referred to as the “Operation”. WHEREAS: 1. From its formation in January 2000, Party A h", "labels": [[14, 52, "DOC_NAME"], [83, 90, "PARTY"], [92, 145, "PARTY"], [279, 286, "PARTY"], [288, 330, "PARTY"], [468, 475, "PARTY"], [477, 527, "PARTY"], [741, 748, "PARTY"], [750, 757, "PARTY"], [762, 769, "PARTY"], [878, 885, "PARTY"], [890, 897, "PARTY"]]}
{"id": 252, "text": "SPONSORSHIP AGREEMENT THIS SPONSORSHIP AGREEMENT (\"Agreement\") is entered into and effective as of the date first written above (\"Effective Date\") by and among PEEK Investments LLC, a Delaware limited liability company (\"Purchaser\"), and each other party hereto identified on the signature page(s) hereto (each, a \"Sponsor\"). Each term used and not otherwise defined herein shall have the meaning assigned to such term in the Offer. RECITALS WHEREAS, Purchaser is tentatively exploring, among other potential alternatives, a possible third-party tender offer to purchase all outstanding shares of common stock, $0.001 par value per share (\"Shares\"), of a Delaware corporation (the \"Company\") upon the terms and subject to the conditions set forth in the Offer to Purchase, related Letter of Transmittal, and other tender offer material provided by or on behalf of Purchaser to the Sponsors (which, collectively, as amended or supplemented, constitute the \"Offer\"); WHEREAS, as requested by Purchaser ", "labels": [[0, 21, "DOC_NAME"], [27, 48, "DOC_NAME"], [160, 180, "PARTY"], [221, 230, "PARTY"], [238, 304, "PARTY"], [315, 322, "PARTY"], [451, 460, "PARTY"], [864, 873, "PARTY"], [881, 888, "PARTY"]]}
{"id": 266, "text": "Exhibit 99.4 JOINT FILING AGREEMENT In accordance with Rule 13d-1(k)(1) promulgated under the Securities Exchange Act of 1934, as amended, the undersigned hereby agree to the joint filing with each of the Reporting Persons (as such term is defined in the Schedule 13D referred to below) on behalf of each of them of a statement on Schedule 13D (including amendments thereto and statements on Schedule 13G) with respect to the Common Stock, par value $0.01 per share of Macy’s, Inc., a corporation organized under the laws of the State of Delaware, and that this agreement may be included as an exhibit to such joint filing. The undersigned acknowledge that each shall be responsible for the timely filing of any amendments, and for the completeness and accuracy of the information concerning the undersigned or contained herein and therein, but shall not be responsible for the completeness and accuracy of the information concerning the others. IN WITNESS WHEREOF, the undersigned hereby execute thi", "labels": []}
{"id": 268, "text": "Exhibit 10.14 OUTSOURCING AGREEMENT BETWEEN INTERNATIONAL BUSINESS MACHINES CORPORATION AND MANUFACTURERS' SERVICES WESTERN U.S. OPERATIONS, INC. EFFECTIVE DATE JUNE 1, 1998 [*] = Information redacted pursuant to a confidential treatment request. An unredacted version of this exhibit has been filed separately with the Commission. IBM Confidential OUTSOURCING BASE AGREEMENT This Outsourcing Base Agreement and the five (5) attachments listed below which are hereby incorporated by reference (\"Agreement\") is entered into by and between International Business Machines Corporation, a corporation incorporated under the laws of New York, U.S.A., having an office for the transaction of business at 8501 IBM Drive, Charlotte, North Carolina 28262 (\"IBM\"), and Manufacturers' Services Western US Operations, Inc., a corporation incorporated under the laws of California, U.S.A., having an office for the transaction of business at 5600 Mowry School Road, Newark, CA 94560 (\"MSL\"). WHEREAS, IBM desires ", "labels": [[44, 87, "PARTY"], [332, 335, "PARTY"], [349, 375, "DOC_NAME"], [381, 407, "DOC_NAME"], [538, 581, "PARTY"], [703, 706, "PARTY"], [748, 751, "PARTY"], [759, 810, "PARTY"], [972, 975, "PARTY"]]}
{"id": 281, "text": "EXHIBIT 10.28 MOVADO GROUP, INC. ENDORSEMENT AGREEMENT WHEREAS, Movado Group, Inc. (the \"Company\") and the Trustees of the Grinberg Family Trust (the \"Trust\") entered into a Policy Collateral Assignment And Split Dollar Agreement, dated as of December 5, 1995 (the \"Split Dollar Agreement\"); and WHEREAS, pursuant to the Split Dollar Agreement, life insurance protection is provided to the beneficiaries of the Trust, upon the of the death of the survivor of Gedalio Grinberg (\"Executive\") and Sonia Grinberg (Executive and Sonia Grinberg are collectively referred to as the \"Insureds\") under a life insurance policy issued to the Trust by the New York Life Insurance Company, Policy No. 45660373 (hereinafter referred to as the \"Policy\"); and WHEREAS, pursuant to the Split Dollar Agreement, the Policy is owned by the Trust and collaterally assigned by it to the Company in order to secure the repayment of the amounts due to the Company in respect of the Company's loans to the Trust which have be", "labels": [[14, 32, "PARTY"], [33, 54, "DOC_NAME"], [64, 82, "PARTY"], [89, 96, "PARTY"], [107, 144, "PARTY"], [139, 144, "PARTY"], [151, 156, "PARTY"], [411, 416, "PARTY"], [631, 636, "PARTY"], [668, 675, "PARTY"], [820, 825, "PARTY"], [865, 872, "PARTY"], [932, 939, "PARTY"], [958, 965, "PARTY"]]}
{"id": 283, "text": "FRANCHISE AGREEMENT TABLE OF CONTENTS 1. INTRODUCTION AND DEFINITIONS.......................................1 1.A. INTRODUCTION..............................................1 1.B. DEFINITIONS...............................................3 2. GRANT OF FRANCHISE RIGHTS..........................................7 2.A. GRANT OF FRANCHISE........................................7 2.B. PRINCIPAL OWNERS' GUARANTY................................7 2.C. TERRITORIAL RIGHTS........................................8 2.D. RESERVATION OF RIGHTS.....................................8 2.E. OPTION TO DEVELOP OTHER SITES WITHIN THE TERRITORY........9 2.F. TERM OF FRANCHISE.........................................9 3. OTHER DISTRIBUTION METHODS........................................10 3.A. SPECIAL DISTRIBUTION ARRANGEMENTS........................10 4. FRANCHISE AND OTHER FEES..........................................10 4.A. INITIAL FRANCHISE FEE....................................10 4.B. DEFERRAL OF FRANCHI", "labels": []}
{"id": 285, "text": "EXHIBIT 10.102 [McDATA LOGO] RESELLER AGREEMENT AGREEMENT NUMBER: 200-04-634-00 McDATA CORPORATION (\"McDATA) \"RESELLER\" MTI TECHNOLOGY CORPORATION 380 INTERLOCKEN CRESCENT ADDRESS: 14661 FRANKLIN AVE BROOMFIELD, CO 80021 ADDRESS: TUSTIN, CA 92780 ADDRESS: THE EFFECTIVE DATE OF THIS RESELLER AGREEMENT SHALL BE: Sept 29, 2004 The following documents are incorporated herein by reference: Reseller Agreement Premier Addendum This Agreement, and all Addendums and attachments hereto, identified above, and Channel Notification Documents as issued by McDATA from time to time constitute the entire agreement between McDATA and Reseller with respect to the subject matter hereof, and supersedes all prior and contemporaneous oral or written representations or agreements between the parties regarding the subject matter of this Agreement. ACCEPTED AND AGREED TO BY: ACCEPTED AND AGREED TO BY: McDATA CORPORATION(McDATA) RESELLER MTI TECHNOLOGY CORPORATION SIGNED: /s/ Bruce Chumley SIGNED: /s/ Ron Umagat", "labels": [[16, 22, "PARTY"], [29, 47, "DOC_NAME"], [80, 98, "PARTY"], [101, 107, "PARTY"], [110, 118, "PARTY"], [120, 146, "PARTY"], [283, 301, "DOC_NAME"], [388, 406, "DOC_NAME"], [548, 554, "PARTY"], [613, 619, "PARTY"], [624, 632, "PARTY"], [889, 907, "PARTY"], [908, 914, "PARTY"], [916, 924, "PARTY"]]}
{"id": 290, "text": "Exhibit 10.14(a) SECOND AMENDED AND RESTATED EXCLUSIVE AGENCY AND MARKETING AGREEMENT by and between MONSANTO COMPANY and THE SCOTTS COMPANY LLC Effective as of September 30, 1998 TABLE OF CONTENTS Article 1 - DEFINITIONS AND RULES OF CONSTRUCTION 1 Section 1.1 Definitions 1 Section 1.2 Rules of Construction and Interpretation 9 Article 2 - EXCLUSIVE AGENCY AND DISTRIBUTORSHIP 9 Section 2.1 Appointment of the Exclusive Agent 9 Section 2.2 The Agent’s Obligations and Standards 10 Section 2.3 Appointment of Sub-Agents and Sub-Distributors 13 Section 2.4 Limitations on Agent 13 Section 2.5 Changes to Markets 13 Section 2.6 Scotts Miracle-Gro Sale Procedures 15 Section 2.7 Compliance 15 Article 3 - ACCOUNTING AND CASH FLOW FOR THE ROUNDUP L&G BUSINESS 17 Section 3.1 Bookkeeping and Financial Reporting 17 Section 3.2 Ordering, Invoicing and Cash Flow Cycle 18 Section 3.3 Expenses and Allocation Rules 19 Section 3.4 Resolution of Disputes Arising under Article 3 20 Section 3.5 Fixed Contribu", "labels": [[17, 85, "DOC_NAME"], [101, 117, "PARTY"], [122, 144, "PARTY"]]}
{"id": 300, "text": "DISTRIBUTOR AGREEMENT by and between PEREGRINE/BRIDGE TRANSFER CORPORATION and NEON SYSTEMS, INC. TABLE OF CONTENTS Article 1 Definitions.......................... 1 Article 2 License Grant......................... 2 Article 3 Pricing and Payment...................... 4 Article 4 Order, delivery and Acceptance................. 4 Article 5 Representations and Warranties of Licensee........... 5 Article 6 Representations and Warranties of Licensor........... 6 Article 7 Covenants of Licensee..................... 6 Article 8 Covenants of Licensor..................... 9 Article 9 Indemnification........................ 10 Article 10 Agreement Not to Compete, Confidentiality........... 12 Article 11 Audits............................. 13 Article 12 Limited Warranties....................... 14 Article 13 Liability........................... 15 Article 14 Term and Termination...................... 16 Article 15 General............................ 18 EXHIBITS Exhibit A List of Products Exhibit", "labels": [[0, 21, "DOC_NAME"], [37, 74, "PARTY"], [79, 97, "PARTY"], [375, 383, "PARTY"], [441, 449, "PARTY"], [486, 494, "PARTY"]]}
{"id": 301, "text": "This Amendment is entered into effective October 1,1996 (\"Amendment Date\") by and between NETGEAR, Inc. (\"NETGEAR\"), a wholly owned subsidiary of Bay Networks, Inc., and Ingram Micro (\"Distributor\") acting on behalf of itself and its affiliates. NETGEAR and Distributor having previously entered into a Distributor Agreement (\"Agreement\") with an Effective Date of March 1,1996, now mutually agree to amend that Agreement as follows: 1. Subject to the terms of this Amendment, the Territory listed in Section 2 of the Agreement is amended to be the United States and [*]. 2. During the initial one year period beginning on the Amendment Date, Distributor shall be the only distributor appointed by NETGEAR in [*], subject to Distributor conducting mutually agreed to marketing activities as described in the Marketing Plan for [*] to be developed and agreed to by and between the parties and which shall be attached to and made a part of this Agreement as Exhibit 4a. For the purposes of this provisi", "labels": [[90, 103, "PARTY"]]}
{"id": 302, "text": "term under the Agreement will not be effective unless mutually agreed to in writing and signed by authorized representatives of both parties. Neither party shall be bound by typographical or clerical errors. G. Neither party is liable for its failure or delay to perform its obligations under the Agreement due to strikes, wars, revolutions, acts of terrorism, fires, floods, explosions, earthquakes, shortages in labor, components or materials, government regulations, or other causes beyond its control. H. This Agreement may not be assigned by either party without prior written permission from the other party, which permission shall not be unreasonably withheld or delayed. Any attempt by either party to assign any right, or delegate any duty or obligation which arises under the Agreement without such permission will be voidable. 19. ENTIRE AGREEMENT, GOVERNING LAW This Agreement, including its attachment and order acknowledgments under the Agreement, constitutes the entire agreement betwe", "labels": []}
{"id": 303, "text": "CONFIDENTIAL TREATMENT REQUEST * Portions denoted with an asterisk have been omitted and filed separately with the Securities and Exchange Commission pursuant to a request for confidential treatment. EXHIBIT 10.16 DISTRIBUTOR AGREEMENT BETWEEN INGRAM MICRO AND NETGEAR NETGEAR Agreement Number: N115 Effective Date: March 1, 1996 Term: 1 Year Ingram Micro, a corporation organized under the laws of the State of California, having a place of business located at 1600 E. St. Andrew Place, Santa Ana, California, USA, (\"Distributor\") and NETGEAR, Inc. (\"NETGEAR\"), a wholly owned subsidiary of Bay Networks, Inc., organized under the laws of the State of Delaware, having a place of business at 4401 Great America Parkway, Santa Clara, California, USA, agree that the following terms govern the purchase, sale, and licensing of Products (as defined below) between the parties. NOTICES: All notices given under the Agreement are to be in writing and may be sent by mail, telefax, courier service or othe", "labels": [[214, 235, "DOC_NAME"], [244, 256, "PARTY"], [261, 268, "PARTY"], [269, 276, "PARTY"], [343, 355, "PARTY"], [518, 529, "PARTY"], [536, 549, "PARTY"]]}
{"id": 312, "text": "1 EXHIBIT 10.26 Confidential Treatment Requested CO-BRANDING AGREEMENT This Co-Branding Agreement (this \"Agreement\") by and between VerticalNet, Inc., a Pennsylvania corporation having a principal place of business at 700 Dresher Road, Suite 100, Horsham, Pennsylvania, PA 19044 (\"VerticalNet\"), and Neoforma.com, Inc., a Delaware corporation having a principal place of business at 3255-7 Scott Boulevard, Santa Clara, CA 95054 (\"Neoforma\"), is dated as of November 19, 1999 (the \"Effective Date\"). In consideration of the mutual covenants herein, and intending to be legally bound hereby, the Parties agree as follows: 1. DEFINITIONS. 1.1 ADVERTISING shall mean any paid advertisements, links, pointers, sponsorships, buttons, banners, navigation, or any other placements or promotions or similar services or rights on a Site, but excluding Advertising that is not paid for or which is part of an overall partnering or revenue sharing arrangement and any Product Listings. 1.2 AFFILIATE shall mean,", "labels": [[49, 70, "DOC_NAME"], [76, 97, "DOC_NAME"], [132, 149, "PARTY"], [281, 292, "PARTY"], [300, 318, "PARTY"], [431, 439, "PARTY"]]}
{"id": 320, "text": "EXHIBIT I TO SCHEDULE A (COMPLIANCE WITH UNITED STATES SECURITIES LAWS) AGENTS’ CERTIFICATE In connection with the offer and sale in the United States of common shares (the “Securities”) of Tribute Pharmaceuticals Inc. (the “Corporation”) to Accredited Investors pursuant to a Subscription Agreement dated as of May 22, 2015, and pursuant to an agency agreement (the “Agency Agreement”) dated as of May 22, 2015 between the Corporation and the agents named therein, [ ] (the “Agent”) and [ ] (the “U.S. Affiliate”), the U.S. registered broker-dealer affiliate of the Agent, hereby certify as follows: (i) on the date hereof and on the date of each offer of Securities by us in the United States and each subsequent sale to such offerees by the Corporation, the U.S. Affiliate is and was: (A) a duly registered as a broker-dealer under the U.S. Exchange Act and duly registered as a broker-dealer under the laws of each state where it made offers of Securities (unless exempt from such registration re", "labels": [[72, 77, "PARTY"], [190, 218, "PARTY"], [225, 236, "PARTY"], [424, 435, "PARTY"], [444, 449, "PARTY"], [466, 469, "PARTY"], [476, 481, "PARTY"], [488, 491, "PARTY"], [498, 512, "PARTY"], [520, 571, "PARTY"], [567, 572, "PARTY"], [744, 755, "PARTY"]]}
{"id": 323, "text": "925 West Georgia Street Suite 1820 Vancouver, British Columbia Canada V6C 3L2 Facsimile: 604-632-1730 PROMOTION AGREEMENT (the “Agreement”) This agreement (the “Agreement”) is made between Charity Tunes Inc., a British Columbia corporation with registered office located at Suite 1800, 925 West Georgia Street, Vancouver, British Columbia, Canada V6C 3L2 (“Charity Tunes”) and ConAgra Foods Canada Inc. (“Sponsor”) a Canada corporation, 5935 Airport Rd, Suite 405, Mississauga, Ontario, Canada L4V 1W5. WHEREAS as a new initiative, Charity Tunes and Sponsor will enter into a promotional partnership, whereby Sponsor will offer Charity Tunes music downloads on Sponsor’s Pogo products consistent with the terms and conditions of this Agreement (the “Promotion”). NOW THEREFORE in consideration of the mutual covenants made herein, and for other good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged by each Charity Tunes and Sponsor, the parties agree as follo", "labels": [[102, 121, "DOC_NAME"], [189, 207, "PARTY"], [357, 370, "PARTY"], [377, 402, "PARTY"], [405, 412, "PARTY"], [532, 545, "PARTY"], [550, 557, "PARTY"], [609, 616, "PARTY"], [628, 641, "PARTY"], [661, 668, "PARTY"], [947, 960, "PARTY"]]}
{"id": 342, "text": "PACIFICAP ENTERTAINMENT Agreement with THE HENRY FILM AND ENTERTAINMENT CORPORATION CONFIDENTIAL Page 1 of 6 CONTENT LICENSE AGREEMENT This Content License Agreement is between THE HENRY FILM AND ENTERTAINMENT CORPORATION, located at 2809 Unicornio, Carlsbad, CA, 92009 and PACIFICAP ENTERTAINMENT’ located at 12868 Via Latina, Del Mar, CA 92014 Licensor: PACIFICAP ENTERTAINMENT Licensee THE HENRY FILM AND ENTERTAINMENT CORPORATION THIS CONTENT LICENSE AGREEMENT (the “Agreement”.) is made as of this 3rd day of November, 2005 In consideration of the mutual, promises contained herein, the parties agree as follows: GRANT OF LICENSE Subject to the terms and conditions of this Agreement, PACIFICAP ENTERTAINMENT hereby grants to THE HENRY FILM AND ENTERTAINMENT CORPORATION, under PACIFICAP ENTERTAINMENT’S full ownership and or fully authorized licensing Rights of Content (a) A 10 year exclusive, worldwide license to use, modify, reproduce, distribute, display and transmit any and all PACIFICAP", "labels": [[109, 134, "DOC_NAME"], [140, 165, "DOC_NAME"], [346, 379, "PARTY"], [380, 433, "PARTY"], [439, 464, "DOC_NAME"]]}
{"id": 346, "text": "Exhibit 10.29 THIS EXHIBIT HAS BEEN REDACTED AND IS THE SUBJECT OF A CONFIDENTIAL TREATMENT REQUEST. REDACTED MATERIAL IS MARKED WITH [* * *] AND HAS BEEN FILED SEPARATELY WITH THE SECURITIES AND EXCHANGE COMMISSION. Execution Version Outsourcing Agreement Between Paratek Pharmaceuticals, Inc. and CARBOGEN AMCIS AG Date 30 December 2016 Source: PARATEK PHARMACEUTICALS, INC., 10-K/A, 5/5/2017 THIS EXHIBIT HAS BEEN REDACTED AND IS THE SUBJECT OF A CONFIDENTIAL TREATMENT REQUEST. REDACTED MATERIAL IS MARKED WITH [* * *] AND HAS BEEN FILED SEPARATELY WITH THE SECURITIES AND EXCHANGE COMMISSION. Table of Contents Article 1 Interpretation 7 1.1 Definitions 7 1.2 Other Definitions 11 1.3 Currency 11 1.4 Headings 11 1.5 Exhibits 11 1.6 Applicable Law 12 Article 2 Term 12 2.1 Term 12 2.2 Effect of Expiration on Purchase Orders 12 Article 3 Supply of Product 12 3.1 Supply of Product 12 3.2 Manufacturing Services 13 3.3 Supply of Materials and Customer Material 13 3.4 Production Capacity 15 3.5 P", "labels": [[235, 256, "DOC_NAME"], [265, 294, "PARTY"], [299, 316, "PARTY"], [347, 376, "PARTY"]]}
{"id": 347, "text": "Exhibit 99.1 CONFIDENTIAL TREATMENT REQUESTED WITH RESPECT TO CERTAIN PORTIONS HEREOF DENOTED WITH “*” MOBILE VIRTUAL NETWORK ENABLER HOSTING AGREEMENT BETWEEN T-MOBILE NETHERLANDS B.V. & Elephant Talk Communication Holding AG Source: PARETEUM CORP, 8-K, 10/1/2008 CONFIDENTIAL TREATMENT REQUESTED WITH RESPECT TO CERTAIN PORTIONS HEREOF DENOTED WITH “*” Hosting Agreement between ELEPHANT TALK and T-Mobile, 18/9/2008 TABLE OF CONTENT 1. Definitions 2. Purpose and Scope of the Agreement 3. Hosting Services 4. Implementation 5. Forecast & Commitments 6. Service level 7. Data Protection & Privacy 8. The co-operation relationship 9. Prices, Charging, Billing & Accounting 10. Customer Care Support 11. Confidentiality 12. Limitation of Liability 13. Suspension and termination of Hosting Services 14. Force Majeure 15. Intellectual Property Rights 16. SIM cards and Calling Credit 17. Duration of the Agreement 18. Termination of the Agreement 19. Modifications 20. Miscellaneous 21. Governing Law ", "labels": [[160, 185, "PARTY"], [188, 226, "PARTY"], [381, 394, "PARTY"], [399, 407, "PARTY"]]}
{"id": 354, "text": "ENDORSEMENT AGREEMENT entered into by and between ANDY NORTH and GOLFERS INCORPORATED Effective February 21, 2011 Source: PERFORMANCE SPORTS BRANDS, INC., S-1, 9/9/2011 TABLE OF CONTENTS Paragraph Page 1. Definitions 3 2. Term 4 3. Grant of License and Exclusivity 4 4. Retention of Rights 4 5. Appearances 4 6. Compensation 5 7. Supply of Endorsed Products 6 8. Approval of Advertising 7 9. Ownership 8 10. SAG and/or AFTRA 8 11. Standards 8 12. Events of Default 8 13. Termination/Remedies 9 14. Company’s Debts 9 15. Indemnification 9 16. Insurance 9 17. Waiver 9 18. Notices 10 19. Assignment 10 20. Independent Contractor 10 21. Joint Venture 10 22. Governing Law 10 23 Entire Agreement 10 24. Amendments 10 25. Authority 11 26. Severability 11 27. Compliance with Laws 11 28. Attorney’s Fees and Costs 11 29. Force Majeure 11 30. Confidentiality 11 31. Counterparts 11 Page 2 of 12 Source: PERFORMANCE SPORTS BRANDS, INC., S-1, 9/9/2011 ENDORSEMENT AGREEMENT THIS ENDORSEMENT AGREEMENT (herein ", "labels": [[0, 21, "DOC_NAME"], [50, 60, "PARTY"], [55, 60, "PARTY"], [65, 85, "PARTY"], [498, 505, "PARTY"], [943, 964, "DOC_NAME"]]}
{"id": 366, "text": "EXHIBIT 99.1 JOINT FILING AGREEMENT The undersigned hereby agree that the statement on Schedule 13G with respect to the equity securities of Q Biomed, Inc. is, and any amendment thereto signed by each of the undersigned shall be, filed on behalf of each of the undersigned pursuant to and in accordance with the provisions of Rule 13d-1(k) promulgated under the Securities Exchange Act of 1934, as amended. The undersigned hereby further agree that this Joint Filing Agreement be included as an exhibit to such statement and any such amendment. The undersigned acknowledge that each shall be responsible for the timely filing of such amendments, and for the completeness and accuracy of the information concerning him or it contained herein and therein, but shall not be responsible for the completeness and accuracy of the information concerning the others. This Joint Filing Agreement may be executed in any number of counterparts, all of which taken together shall constitute one and the same inst", "labels": [[13, 35, "DOC_NAME"], [454, 476, "DOC_NAME"]]}
{"id": 369, "text": "EXHIBIT 99.2 e-business Hosting Agreement 1.0 Introduction This e-business Hosting Agreement (“Agreement”) between International Business Machines Corporation (“IBM”) and The Quantum Group Inc., (“Customer”), sets forth the terms and conditions under which IBM will provide hosting and related services (“Services”) to Customer. The Agreement includes the terms and conditions and the documents referenced herein (“Base Terms”) and the following Attachments: Attachment A - Services; Attachment B – Hosting Components; and Attachment C – Charges In the event of a conflict between the Base Terms and an attachment listed herein (“Attachment”), the Base Terms will prevail, except where an Attachment, or a provision contained therein expressly states that it will prevail over the Base Terms. 2.0 Definitions “Acceptable Use Policy” means the Acceptable Use Policy for IBM e-business Services, located on the Internet at www.ibm.com/services/e-business/aup.html, as of the Effective Date, and any sub", "labels": [[13, 41, "DOC_NAME"], [64, 92, "DOC_NAME"], [115, 158, "PARTY"], [161, 164, "PARTY"], [171, 193, "PARTY"], [197, 205, "PARTY"], [257, 260, "PARTY"], [319, 327, "PARTY"], [869, 872, "PARTY"]]}
{"id": 375, "text": "2008 Sponsorship Agreement- Renewal Sponsor Exhibit 10.75 SPONSORSHIP AGREEMENT AGREEMENT SUMMARY SPONSOR: Name: Rubio’s Fresh Mexican Grill Phone: 760/602-3611 Address: 1902 Wright Place, Suite 300 Carlsbad, CA 92008 E-mail: * Attn: Lawrence A. Rusinko SPONSORSHIP BENEFITS: San Diego Ballpark Funding LLC (“SDBF”) shall provide Sponsor with the following benefits, subject to the terms of the General Provisions attached hereto (the “General Provisions”): Signage benefits oOne Terrace Level fascia sign. The sign is approximately 3’ x 16’. SDBF to pay production costs for installation of new signage. SDBF shall install this sign on or before March 28, 2008. Promotional benefits oPadres Magazine. Sponsor shall be entitled to one (1) full page, four-color advertisement, which advertisement is subject to the prior written approval of SDBF in its reasonable discretion, in each issue of the Padres Magazine published during the regular season of the Term. Hospitality benefits oSeason Tickets. S", "labels": [[5, 26, "DOC_NAME"]]}
{"id": 379, "text": "Exhibit 4 Rare Element Resources Ltd. EXECUTION COPY IP Rights Agreement INTELLECTUAL PROPERTY RIGHTS AGREEMENT Synchron, a California corporation having a principal place of business at 3550 General Atomics Court, San Diego, CA 92121-1122 (or one or more Affiliates, the \"Investor\"), and Rare Element Resources Ltd., a British Columbia Corporation having a principal place of business at P.O. Box 271049, Littleton, Colorado 80127 (the \"Company\") (Investor and Company each a “Party” and together the \"Parties\"), agree as follows: I. Background of Agreement 1.00 Company is the owner of certain Patents and related Technical Information relating to rare earth mineral processing and rare earth separation. 1.01 Investor wishes to acquire certain rights under the Patents and related Technical Information in accordance with the terms of this IP Agreement. 1.02 Company and Investor are concurrently entering into an Investment Agreement (\"Investment Agreement\") whereby Investor is making a monetary", "labels": [[10, 37, "PARTY"], [73, 111, "DOC_NAME"], [112, 120, "PARTY"], [273, 281, "PARTY"], [289, 316, "PARTY"], [438, 445, "PARTY"], [449, 457, "PARTY"], [462, 469, "PARTY"], [564, 571, "PARTY"], [712, 720, "PARTY"], [862, 869, "PARTY"], [874, 882, "PARTY"]]}
{"id": 388, "text": "Exhibit 10.6 OPERATIONS AND MAINTENANCE AGREEMENT Between Piñon Gathering Company, LLC And SandRidge Midstream, Inc. TABLE OF CONTENTS i PAGE ARTICLE I DEFINITIONS 1 ARTICLE II ENGAGEMENT OF OPERATOR 6 2.1 Engagement 6 2.2 Independent Contractor 6 2.3 Owner Cooperation 6 ARTICLE III TERM; RESIGNATION OR REMOVAL OF OPERATOR 7 3.1 Term 7 3.2 Owner Default 7 3.3 Operator Default 7 3.4 Cooperation with Owner or Successor Operator 8 3.5 Effect of Termination 8 3.6 No Breach 8 ARTICLE IV DUTIES AS OPERATOR 9 4.1 Duties as Operator 9 4.1.1 Operation and Maintenance of the Gathering System 9 4.1.2 Purchase of Material and Supplies 9 4.1.3 Personnel 9 4.1.4 Payment of Operating Expenses 9 4.1.5 Proposed Operating Expense Budget 10 4.1.6 Capital Projects 10 4.1.7 Emergencies 11 4.1.8 Reporting By Operator 11 4.1.9 Commercial Activities 12 4.1.10 Regulatory Affairs 12 4.1.11 Devotion of Time 12 4.2 Standard of Care 12 4.3 Limitation of Authority 13 4.3.1 Binding Owner 13 4.3.2 Asset Sales 13 4.3.", "labels": [[13, 49, "DOC_NAME"], [58, 86, "PARTY"], [91, 116, "PARTY"], [191, 199, "PARTY"], [252, 257, "PARTY"], [316, 324, "PARTY"], [342, 347, "PARTY"], [362, 370, "PARTY"], [402, 407, "PARTY"], [421, 429, "PARTY"], [497, 505, "PARTY"], [522, 530, "PARTY"], [798, 806, "PARTY"]]}
{"id": 392, "text": "Contract No.: DDCX S DG KC 201812130044 Exhibit 10.5 Collaboration Agreement This Collaboration Agreement (hereinafter referred to as this “Agreement\") is made and entered into by and between the following parties in Haidian District, Beijing. This Agreement may be executed in paper form offline or in electronic form through the Didi Chuxing Online Contracting Platform (website: https://Agreement.didichuxing.com/, hereinafter referred to as the “Contracting Platform”). The Agreement executed offline in paper form shall become effective upon the completion of the execution by both Parties (hereinafter referred to as the “Effective Date”); and the Agreement executed online in electronic form shall become effective upon the completion of the execution on the Contracting Platform by both Parties (hereinafter referred to as the “Effective Date”) recorded by the third-party Online Document Depository. Party A: Didi Chuxing Technology Co., Ltd. Legal Representative: Ting Chen Party B: Hunan R", "labels": [[53, 76, "DOC_NAME"], [82, 105, "DOC_NAME"], [909, 916, "PARTY"], [918, 951, "PARTY"]]}
{"id": 398, "text": "EXHIBIT 10.26 *Confidential treatment requested pursuant to a request for confidential treatment filed with the Securities and Exchange Commission. Omitted portions have been filed separately with the Commission. FLEET MAINTENANCE AGREEMENT 1. Definitions 1.1 In this Agreement: 1.1.1 the following expressions have the following meanings unless inconsistent with the context: “the Act” means the Employment Rights Act 1996. “Additional Charges” means the charges to be calculated by SEV on a time and materials basis at the rates described in Clause 7 of this Agreement in respect of the provision of Excepted Services pursuant to Clause 6 of this Agreement. “Agreement” means this agreement including the Schedules and the appendix made between SEV and DCL “Bodywork” means, without limitation, the panels, doors, glazing, trim, seating and any custom built additions not supplied by the original Vehicle manufacturer “CDV” means an Engine powered car derived van included in this Agreement “Charge", "labels": [[213, 240, "DOC_NAME"], [484, 487, "PARTY"], [747, 750, "PARTY"]]}
{"id": 399, "text": "Exhibit 1.2 SERVICES AGREEMENT This Services Agreement (“Services Agreement” or “Agreement”) is entered into as of the date noted below (the “Effective Date”) between StartEngine Crowdfunding, Inc., a Delaware corporation (“Company”), and Solutions Vending International, Inc a DE corporation (“Customer” or “you”). 1. Services Company agrees to make available to Customer the ability to present information with respect to its securities offering (the “Offering”) to Users, and to permit Users to create and manage online accounts, view information regarding the Customer, indicate interest in the Offering, and to subscribe to the Offering by signing a subscription agreement or similar instrument and transmitting payment instructions (together, the “Services”). A “User” means a natural person, corporation or other entity that has established an account on the Company’s website. 2. Fees and expenses a) Generally In exchange for the Services, you shall pay the Company the then applicable fees ", "labels": [[12, 30, "DOC_NAME"], [36, 54, "DOC_NAME"], [57, 75, "DOC_NAME"], [167, 197, "PARTY"], [224, 231, "PARTY"], [239, 275, "PARTY"], [328, 335, "PARTY"], [866, 873, "PARTY"]]}
{"id": 401, "text": "Exhibit 10.13 SOFTWARE LICENSE AND MAINTENANCE AGREEMENT BETWEEN GARMAN ROUTING SYSTEMS, INC. (\"GARMAN\") AND SPARKLING SPRING WATER GROUP LIMITED (\"SPARKLING\") WHEREAS Garman has developed and is entitled to license to others certain software and supporting materials which Sparkling wishes to license, the parties agree as follows: 1. DEFINITIONS AND SCHEDULES In this Agreement the following definitions shall apply: (a) Authorized Locations means the locations listed in Schedule \"C.\" (b) Confidential Information has the meaning specified in Section 14. (c) Documentation means the documentation related to use of the Software described in Schedule \"B.\" (d) Maintenance Commencement Date means the date that acceptance testing is successfully completed at all of the Authorized Locations. (e) Maintenance Services means the Software Update Service, Telephone Support Service and Software Repair Service described in Section 10. (f) Modifications means the modifications set out in Schedule \"D.\" (", "labels": [[14, 56, "DOC_NAME"], [65, 93, "PARTY"], [96, 102, "PARTY"], [109, 145, "PARTY"], [148, 157, "PARTY"], [168, 174, "PARTY"]]}
{"id": 403, "text": "Exhibit 99.5 [*] Designates portions of this document that have been omitted pursuant to a request for confidential treatment filed separately with the Commission. OPERATIONS AND MAINTENANCE AGREEMENT Service Provider: Solar Power, Inc. SEF Host Customer: Aerojet — Phase 1 SEF Site Location: Rancho Cordova, CA THIS OPERATIONS AND MAINTENANCE AGREEMENT (this “Agreement”) is made and entered into as of the latest date referenced on the signature page below (the “Effective Date”), by and between Solar Tax Partners 1, LLC, a California limited liability company (“Owner”), and Solar Power, Inc. (“Service Provider”). Owner and Service Provider are sometimes hereinafter referred to individually as a “Party” and collectively as the “Parties.” RECITALS A. Owner operates a solar energy facility (the “SEF”), and more particularly defined in Exhibit A hereto on the premises (the “Premises”) described in Exhibit B hereto for the purposes of providing electric power to the Owner’s host customer, Aer", "labels": [[164, 200, "DOC_NAME"], [201, 217, "PARTY"], [219, 236, "PARTY"], [317, 353, "DOC_NAME"], [498, 523, "PARTY"], [566, 571, "PARTY"], [579, 596, "PARTY"], [599, 615, "PARTY"], [619, 624, "PARTY"], [629, 645, "PARTY"], [757, 762, "PARTY"]]}
{"id": 404, "text": "Exhibit 10.47 Cooperation Agreement of 50MWp Photovoltaic Grid-connected Power Generation Project in Yangqiao of Fenyi County Party A: People’s Government of Fenyi County Party B: Xinyu Xinwei New Energy Co., Ltd. Party A welcomes and supports Party B to invest and develop new energy project in Fenyi County, and Party B is willing to invest and build 50MWp photovoltaic grid-connected power generation project in Fenyi County; both parties, in the principle of equality, mutual benefits, win-win cooperation and solid progress, reach the following cooperation agreement as for relevant matters of the project: I. Party A supports and guarantees the project construction and development of Party B, and will provide the most preferential policies and all- round service in the aspects of preliminary work, construction and grid-connected of the project, and actively coordinate relevant departments and units to help Party B accelerate project construction progress. Party B will give full play to t", "labels": [[14, 35, "DOC_NAME"], [126, 133, "PARTY"], [171, 178, "PARTY"], [180, 213, "PARTY"], [214, 221, "PARTY"], [244, 251, "PARTY"], [314, 321, "PARTY"], [550, 571, "DOC_NAME"], [615, 622, "PARTY"], [691, 698, "PARTY"], [918, 925, "PARTY"]]}
{"id": 409, "text": "TAT-14 CABLE NETWORK CONSTRUCTION AND MAINTENANCE AGREEMENT [GRAPHIC OMITTED] Certified to be a true and complete copy of the original document in the custody of Deutsche Telekom - Volkmar Rompke Carmen Bornefeld Deutsche Telekom AG, Friedrich-Ebert-Allee 140, 53113 Bonn, Germany TABLE OF CONTENTS 1 DEFINITIONS 2 2 BASIC PRINCIPLES 6 3 CONFIGURATION 6 4 PROVISION OF SEGMENTS T AND S 8 5 OWNERSHIP OF SEGMENTS AND ADDITIONAL PROPERTY 9 6 ESTABLISHMENT OF THE GENERAL COMMITTEE 9 7 ESTABLISHMENT OF MANAGING GROUP 11 8 PROCUREMENT GROUP; SUPPLY CONTRACT FOR SEGMENT S 12 9 ACQUISITION AND USE OF CAPACITY 13 10 EQUIPAGE 15 11 INCREASE OR DECREASE OF DESIGN CAPACITY 15 12 OWNERSHIP PRICING 16 13 DEFINITION OF CAPITAL COSTS OF SEGMENT S 16 14 ALLOCATION AND BILLING OF SEGMENT S CAPITAL COSTS 17 15 TRANSIT FACILITIES TO EXTEND TAT-14 CAPACITY 19 AND CONNECTION WITH INLAND SYSTEMS 16 OPERATION AND MAINTENANCE OF SEGMENTS T AND S 20 17 OPERATION AND MAINTENANCE COSTS OF SEGMENTS -ALLOCATION AND BI", "labels": [[21, 59, "DOC_NAME"]]}
{"id": 410, "text": "Exhibit 10.1 COOPERATION AGREEMENT BETWEEN THE CITY OF FORT STOCKTON, TEXAS AND STW RESOURCES HOLDING CORP. REGARDING DEVELOPMENT OF WATER WELL(S) IN THE CAPITAN REEF AQUIFER FORMATION This AGREEMENT regarding development of water well(s) in the Capitan Reef Aquifer Formation (the “AGREEMENT”) is entered into by the City of Fort Stockton, Texas, a Texas Type A-General Law city (“COFS”) and STW Resources Holding Corp., a Nevada corporation (“STW”), effective as of the last date of signature on the signature pages below. STW and COFS are sometimes individually referred to as a “Party” and collectively referred to as the “Parties.” WHEREAS, the City of Fort Stockton, Texas (“COFS”) owns the surface and groundwater rights to several areas of the Capitan Reef Aquifer Formation; and WHEREAS, COFS has an existing Capitan Reef Aquifer (“CRA”) water well located at Section 112 on COFS property, which is currently drilled to an approximate depth of 3,500 feet (the “Existing CRA Well”), and also ", "labels": [[13, 34, "DOC_NAME"], [47, 68, "PARTY"], [80, 106, "PARTY"], [318, 339, "PARTY"], [393, 419, "PARTY"]]}
{"id": 411, "text": "Exhibit 10.2 STRATEGIC ALLIANCE AGREEMENT dated as of August 26, 2015 among Sucampo Pharmaceuticals, Inc., Sucampo Pharma, LLC. and R-Tech Ueno, Ltd. TABLE OF CONTENTS ARTICLE I DEFINITIONS AND INTERPRETATION Section 1.01 Definitions 2 Section 1.02 Interpretation 8 ARTICLE II TRANSACTION Section 2.01 Strategic Alliance 8 Section 2.02 Obligations of Acquiror 9 Section 2.03 Obligations of the Company 11 ARTICLE III REPRESENTATIONS AND WARRANTIES Section 3.01 Representations and Warranties of the Company 11 Section 3.02 Representations and Warranties of Acquiror 12 ARTICLE IV COVENANTS OF THE PARTIES Section 4.01 The Company’s Obligation 12 Section 4.02 Consummation of the Squeeze-out 15 Section 4.03 Applications and Consents; Governmental Communications and Filings 15 Section 4.04 Further Assurance 15 Section 4.05 Access 15 Section 4.06 Notifications 16 Section 4.07 Confidentiality 16 Section 4.08 Public Announcement 17 Section 4.09 No Lender Liability 17 Section 4.10 Employees of Compan", "labels": [[54, 69, "AGMT_DATE"], [76, 105, "PARTY"], [107, 127, "PARTY"], [132, 149, "PARTY"], [351, 359, "PARTY"], [394, 401, "PARTY"], [499, 506, "PARTY"], [557, 565, "PARTY"]]}
{"id": 415, "text": "Exhibit 10.1 FORM OF SUB-RESELLER AGREEMENT Signature Page Reseller Full Legal Name Salesforce.org, a nonprofit public benefit corporation having its principal place of business at 50 Fremont Street, Suite 300, San Francisco, California 94105 This Form of Sub-Reseller Agreement (this “Sub-Reseller Agreement”) is made and entered in by and between salesforce.com, inc., a Delaware corporation having its principal place of business at The Landmark @ One Market, Suite 300, San Francisco, California 94105 (“SFDC” or “Salesforce”) and the Reseller named above and amends that certain Reseller Agreement between Salesforce and Reseller dated as of August 1, 2015, as previously amended (the “Agreement”). This Sub-Reseller Agreement is effective as of the later of the dates beneath the Parties’ signatures below (“Sub-Reseller Effective Date”), provided, however, that the dates of the Parties’ signatures are not separated by a period of time greater than ten (10) business days. If such period is g", "labels": [[13, 43, "DOC_NAME"], [84, 98, "PARTY"], [248, 278, "DOC_NAME"], [349, 369, "PARTY"]]}
{"id": 417, "text": "Exhibit 10.38 IN ACCORDANCE WITH ITEM 601(b) OF REGULATION S-K, CERTAIN IDENTIFIED INFORMATION (THE “CONFIDENTIAL INFORMATION”) HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS BOTH (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM IF PUBLICLY DISCLOSED. THE CONFIDENTIAL INFORMATION IS DENOTED HEREIN BY [*]. CISCO SYSTEMS, INC. NONEXCLUSIVE VALUE ADDED DISTRIBUTOR AGREEMENT This Nonexclusive Value Added Distributor Agreement (\"Agreement\"), between ScanSource, Inc., a South Carolina corporation, with its principal place of business at 6 Logue Court, Greenville, South Carolina, 29615 (\"Distributor\"), and Cisco Systems, Inc., a California corporation with its principal place of business at 170 West Tasman Drive, San Jose, California 95134 - 1706, (\"Cisco\") is entered into as of the date last written below (\"the Effective Date\"). This Agreement consists of this signature page and the following attachments, each of which is incorporated into this Agreement by reference: 1. None", "labels": [[323, 342, "PARTY"], [343, 389, "DOC_NAME"], [368, 379, "PARTY"], [395, 441, "DOC_NAME"], [420, 431, "PARTY"], [465, 481, "PARTY"], [604, 615, "PARTY"], [623, 642, "PARTY"]]}
{"id": 419, "text": "Exhibit 10.39 IN ACCORDANCE WITH ITEM 601(b) OF REGULATION S-K, CERTAIN IDENTIFIED INFORMATION (THE “CONFIDENTIAL INFORMATION”) HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS BOTH (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM IF PUBLICLY DISCLOSED. THE CONFIDENTIAL INFORMATION IS DENOTED HEREIN BY [*]. AMENDMENT NO. 3 TO THE NONEXCLUSIVE VALUE ADDED DISTRIBUTOR AGREEMENT This Amendment No. 3 (“Amendment No. 3\") to the Nonexclusive Value Added Distributor Agreement, as amended (\"Agreement''), by and between Cisco Systems, Inc. (\"Cisco\"), a California corporation having Its principal place of business at 170 West Tasman Drive, San Jose, CA, 95134, and ScanSource, Inc. (\"Distributor\"), a South Carolina corporation with a place of business at 6 Logue Court, Greenville, South Carolina, 29615, is effective as of the date last signed below (\"Amendment Effective Date”). All capitalized terms contained herein shall have the same meaning as the terms defined in the Agreement u", "labels": [[323, 392, "DOC_NAME"], [371, 382, "PARTY"], [466, 477, "PARTY"], [531, 550, "PARTY"], [553, 558, "PARTY"], [677, 693, "PARTY"]]}
{"id": 420, "text": "Exhibit 10.1 Certain portions of this exhibit have been omitted pursuant to Rule 601(b)(10) of Regulation S-K. The omitted information is (i) not material and (ii) would likely cause competitive harm to the Company if publicly disclosed. Information that has been omitted has been noted in this document with a placeholder identified by the mark “[*]”. EXECUTION COPY PROMOTION AGREEMENT by and between SIGA TECHNOLOGIES, INC. and MERIDIAN MEDICAL TECHNOLOGIES, INC., a Pfizer company Source: SIGA TECHNOLOGIES INC, 8-K, 6/3/2019 TABLE OF CONTENTS PAGE ARTICLE 1 DEFINITIONS 1 ARTICLE 2 GRANT OF RIGHTS 11 2.1 Grant of Rights to MMT 11 2.2 Negative Covenants 11 2.3 Non-Compete Covenant 11 2.4 Retained Rights 12 2.5 No Implied Licenses 12 2.6 [*] 12 ARTICLE 3 GOVERNANCE 12 3.1 Joint Steering Committee 12 3.2 Good Faith 12 3.3 Scope of Governance 13 ARTICLE 4 PROMOTION AND OTHER COMMERCIALIZATION 13 4.1 Promotion in the Territory 13 4.2 Diligence 14 4.3 Customer Contracts 14 4.4 Regulatory Matte", "labels": [[368, 387, "DOC_NAME"], [403, 426, "PARTY"], [431, 466, "PARTY"], [493, 497, "PARTY"]]}
{"id": 421, "text": "EXHIBIT 10.1 STRATEGIC SALES & MARKETING AGREEMENT THIS STRATEGIC SALES & MARKETING AGREEMENT (the “Agreement”) is effective as of the last date provided for on the signature page and is entered into by and between SightLife Surgical, Inc., a Delaware corporation, having its principal place of business at 1200 6th Ave, Ste. 300, Seattle, WA 98101 (“Surgical”) and Imprimis Pharmaceuticals, Inc., a Delaware corporation, and its subsidiaries, having its principal place of business at 12264 El Camino Real, Suite 350, San Diego, CA 92130 (“Imprimis”). WHEREAS, Imprimis and/or its subsidiary companies are licensed and accredited pharmacies and/or outsourcing facilities; WHEREAS, Surgical is a cornea-focused organization that provides comprehensive services to support ophthalmic surgeons; and WHEREAS, Imprimis wishes to engage Surgical and its employees to provide contract sales services under the terms and conditions as set forth below. NOW THEREFORE, in consideration of the mutual promises ", "labels": [[13, 50, "DOC_NAME"], [56, 93, "DOC_NAME"], [215, 239, "PARTY"], [225, 233, "PARTY"], [351, 359, "PARTY"], [366, 396, "PARTY"], [541, 549, "PARTY"], [562, 570, "PARTY"], [682, 690, "PARTY"], [806, 814, "PARTY"]]}
{"id": 424, "text": "Exhibit 10.07 [*] Certain confidential information contained in this document, marked by brackets, has been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 406 of the Securities Act of 1933, as amended. Manufacturing Agreement Between Sonos, Inc. And IAC TABLE OF CONTENTS 1.0 DEFINITIONS 3 2.0 SCOPE OF RELATIONSHIP 8 3.0 OWNERSHIP; GRANT OF RIGHTS; TRADEMARKS USAGE 8 4.0 MANUFACTURING OPERATIONS; COMPLIANCE 9 5.0 FORECASTS, PURCHASE ORDERS AND DELIVERY 12 6.0 PRODUCT ACCEPTANCE, INVOICING, QUARTERLY PRICING UPDATES, AND SHIPPING TERM 13 7.0 PRICES; PAYMENT TERMS 14 8.0 NPI; FUTURE PRODUCTS 18 9.0 REPAIR SERVICES; PROVISION FOR EXTENDED WARRANTY 18 10.0 REPRESENTATIONS AND WARRANTIES 19 11.0 INDEMNITY 19 12.0 CONFIDENTIALITY 20 13.0 USE OF CONTRACTORS; COMPLIANCE WITH LABOR LAWS 22 14.0 LIMITATION OF LIABILITY 22 15.0 TERM AND TERMINATION 23 16.0 MISCELLANEOUS 24 Exhibit Exhibit Description A Statements of Work B Program Managers C Flexibility a", "labels": [[245, 268, "DOC_NAME"], [277, 288, "PARTY"]]}
{"id": 425, "text": "Exhibit 10.1 KIOSK CONCEPTS, INC. MASTER FRANCHISE AGREEMENT THE GRILLED CHEESE TRUCK, INC. MASTER FRANCHISEE DATE OF AGREEMENT Source: SOUPMAN, INC., 8-K, 8/14/2015 TABLE OF CONTENTS 1. GRANT OF FRANCHISE 1 1.1 Rights Granted to You 1 1.2 Non-Exclusive Grant 2 1.3 Our Reserved Rights 2 2. OPERATION OF THE FRANCHISED BUSINESS 2 2.1 Name of Franchised Business 2 2.2 Full Time, Attention and Best Efforts 2 2.3 Modifications to System and Manuals 3 3. INITIAL AND EXTENDED TERMS 3 3.1 Initial Term 3 3.2 Options to Renew 3 3.3 Renewal of Existing Agreement 4 3.4 Continued Compliance 4 3.5 Termination at End of Term 4 4. PAYMENT OF FEES 4 4.1 Initial Franchise Fee 4 4.2 Continuing Fees Payable to Us 4 4.3 Manner of Payment 5 4.4 Interest on Overdue Amounts 5 4.5 Late Fee; Insufficient Funds Fee 6 4.6 Unit Franchise Agreements and Revenue Reports 6 4.7 Security Interest 6 4.8 Reimbursement of Monies 7 4.9 Application of Fees 7 5. YOUR OBLIGATIONS 7 5.1 Sale of Unit Franchises; Minimum Develop", "labels": [[13, 33, "PARTY"], [34, 60, "DOC_NAME"], [61, 91, "PARTY"], [92, 109, "PARTY"], [129, 132, "PARTY"], [230, 233, "PARTY"], [248, 250, "PARTY"], [266, 269, "PARTY"], [320, 322, "PARTY"], [354, 356, "PARTY"], [700, 702, "PARTY"], [937, 941, "PARTY"]]}
{"id": 428, "text": "ADDENDUM REQUIRED BY THE DEPARTMENT OF LAW OF THE STATE OF NEW YORK The following Items are required to be included within the Disclosure Document and shall be deemed to supersede the language in the Disclosure Document itself: 3. LITIGATION Neither the Franchisor, its Predecessor nor any person listed under Item 2 or an affiliate offering franchises under Franchisor’s principal trademark: (A) has an administrative, criminal or civil action pending against that person alleging: a felony; a violation of a franchise, antitrust or securities law; fraud; embezzlement; fraudulent conversion; misappropriation of property; unfair or deceptive practices; or comparable civil or misdemeanor allegations. (B) has been convicted of a felony or pleaded nolo contendere to a felony charge or, within the ten year period immediately preceding the application for registration, has been convicted of or pleaded nolo contendere to a misdemeanor charge or has been the subject of a civil action alleging: viol", "labels": []}
{"id": 434, "text": "Exhibit 26 JOINT FILING AGREEMENT Pursuant to and in accordance with the Securities Exchange Act of 1934, as amended, and the rules and regulations thereunder (the “Exchange Act”) the undersigned hereby agree to the joint filing on behalf of each of them of any filing required by such party under Section 13 of the Exchange Act or any rule or regulation thereunder (including any amendment, restatement, supplement, and/or exhibit thereto) with respect to securities of Tallgrass Energy, LP, a Delaware limited partnership, and further agree to the filing, furnishing, and/or incorporation by reference of this Agreement as an exhibit thereto. Each of them is responsible for the timely filing of such filings and any amendments thereto, and for the completeness and accuracy of the information concerning such person contained therein; but none of them is responsible for the completeness or accuracy of the information concerning the other persons making the filing, unless such person knows or ha", "labels": []}
{"id": 436, "text": "Exhibit 10.10 ASIA PACIFIC CABLE NETWORK 2 CONSTRUCTION AND MAINTENANCE AGREEMENT Singapore April 18th, 2000 TABLE OF CONTENTS PARAGRAPH 1 Definitions and Interpretations 2 APCN 2 Configuration 3 Establishment of the APCN 2 Management Committee 4 Provision, Construction and Ownership of Segments 5 Definition of APCN 2 Capital Costs 6 Definition of Operation and Maintenance Costs 7 Allocation and Billing of APCN 2 Costs 8 Currency of Payment 9 Keeping and Inspection of Books for Segment S and T 10 Duties and Rights as to Operation and Maintenance of Segments 11 Use of Segment T 12 Acquisition and Use of Capacity 13 Expansion of Equipped Capacity 14 Increase or Decrease of Design Capacity 15 Obligation to Provide Transiting Facilities to Extend APCN2 Capacity 16 Obligation to Connect the APCN 2 with Inland Systems 17 Direct Access to Network Interface and Equal Access to Terminal Station 18 Duration of Agreement and Realization of Assets 19 Obtaining of Approvals 20 Privileges for Docume", "labels": []}
{"id": 437, "text": "-1 - TELKOM CONTRACT No. 076C/01 LICENCE AND MAINTENANCE AGREEMENT entered into by and between SYSTEMS APPLICATIONS PRODUCTS (AFRICA) (PTY) LIMITED (\"SAP AFRICA\") a company incorporated in accordance with the laws of the Republic of South Africa with offices at SAP Business Park, 1 Woodmead Drive, Woodmead, Sandton and TELKOM SOUTH AFRICA LIMITED (\"TELKOM\") a company incorporated in accordance with the laws of the Republic of South Africa with its head office at 152 Proes Street, Pretoria - 2 - TELKOM CONTRACT No. 076C/01 1. RECORDAL It is recorded that: 1. 1. SAP AFRICA wishes to grant to TELKOM and TELKOM wishes to accept from SAP AFRICA a licence to use the SOFTWARE (as defined in clause 2. 3. 11), upon the terms and conditions hereinafter set forth. 1. 2. The SOFTWARE to be licensed in terms hereof will enable TELKOM to establish, manage and operate an Internet-based business platform for TELKOM'S e- commerce exchange, that is, a \"Marketplace\" as defined in clause 3. 9. 1. 3. The p", "labels": [[33, 66, "DOC_NAME"], [95, 147, "PARTY"], [150, 160, "PARTY"], [321, 348, "PARTY"], [349, 359, "PARTY"], [567, 577, "PARTY"]]}
{"id": 441, "text": "Exhibit 10.12.1 Confidential Execution Version [*] Certain information in this document has been excluded because it both (i) is not material and (ii) would likely cause competitive harm to the registrant if publicly disclosed. JOINT VENTURE AGREEMENT by and among Aizu Fujitsu Semiconductor Limited Fujitsu Semiconductor Limited and Transphorm, Inc. Date May 23, 2017 Confidential Execution Version TABLE OF CONTENTS Page Article I Definitions 1 Article II Representations and Warranties of the Parties 4 2.1 Representations and Warranties of AFSL and FSL 4 2.2 Representations and Warranties of TPH-A and TPH 6 Article III Operation of the Company 7 3.1 Activities 7 3.2 Cash Requirement of the Company 7 3.3 Business Plan 7 3.4 Independent Entity 8 Article IV Management of the Company 8 4.1 Board 8 4.2 Composition of the Board 8 4.3 Board Observers 9 4.4 Meetings; Quorum 9 4.5 Personnel; Representative Director 9 4.6 Statutory Auditors 9 4.7 Actions Requiring Unanimous Board Approval 9 4.8 Ag", "labels": [[228, 251, "DOC_NAME"], [265, 299, "PARTY"], [334, 350, "PARTY"], [544, 548, "PARTY"], [545, 548, "PARTY"], [553, 556, "PARTY"], [597, 600, "PARTY"]]}
{"id": 442, "text": "OUTSOURCING AGREEMENT BY AND BETWEEN TRI CITY NATIONAL BANK and MARSHALL & ILSLEY CORPORATION acting through its division M&I DATA SERVICES DATED AS OF February 16, 1998 TABLE OF CONTENTS Page 1. DEFINITIONS 1.1 Background 1.2 Definitions 1.3 References 1.4 Interpretation 2. TERM 2.1 Initial Term 2.2 Extensions 3. APPOINTMENT 3.1 Performance by M&I Affiliates 3.2 Third Party Services 3.3 Proper Instructions 4. CONVERSION 4.1 Banking Applications 4.2 Development of Conversion Plan 4.3 Conversion Resources 4.4 Conversion Milestones 5. OUTSOURCING OF TRUST SERVICES 6. BANKING APPLICATIONS 6.1 Services to be Rendered 6.2 Banking Application Processing 6.3 Corporate Support Services 6.4 Item Processing Services 6.5 Automated Clearing House Services 6.6 Home Banking and Internet Services 6.7 Retail Delivery Systems 6.8 Visa Check/MasterMoney Card Services 6.9 EFT Services 7. FACILITIES MANAGEMENT 8. FEES 8.1 Fee Structure 8.2 Conversion 8.3 Pricing and Operational Assumptions 8.4 Banking App", "labels": [[0, 21, "DOC_NAME"], [37, 59, "PARTY"], [64, 93, "PARTY"], [122, 125, "PARTY"]]}
{"id": 444, "text": "EXHIBIT 10.1 DEVELOPMENT AGREEMENT THIS DEVELOPMENT AGREEMENT (“Agreement”), made and entered into effective as of January 1, 2007 (the “Effective Date”), by and between BP AMERICA PRODUCTION COMPANY (“BP”), a Delaware corporation, with an office at 501 Westlake Park Boulevard, Houston, Texas 77079, and TRUE NORTH ENERGY CORP. (“Company”), a Nevada corporation, with an office at 1200 Smith Street, 16th Floor, Houston, Texas 77002 (individually, a “Party” and collectively, the “Parties”). WITNESSETH: WHEREAS, BP owns those certain oil, gas and mineral leases set forth in Exhibit “A” (the \"Leases\") covering the Contract Area; and WHEREAS, subject to the terms, provisions and conditions set forth below, Company will pay a disproportionate 11.67% of the Drilling Costs for the BP America Production Company - A. Major Heirs No. 1 well (the “Initial Well”) to be drilled at the location shown on the plat attached as Exhibit “C”, and in return BP will assign to Company an 8.75% interest in the ", "labels": [[115, 130, "AGMT_DATE"], [170, 199, "PARTY"], [192, 199, "PARTY"], [202, 204, "PARTY"], [305, 328, "PARTY"], [331, 338, "PARTY"], [452, 457, "PARTY"], [482, 489, "PARTY"], [514, 516, "PARTY"], [710, 717, "PARTY"], [783, 812, "PARTY"], [805, 812, "PARTY"], [949, 951, "PARTY"]]}
{"id": 447, "text": "QuickLinks Click here to rapidly navigate through this document Exhibit 99.12 TRANSPORTATION SERVICE AGREEMENT Contract Identification FT18150 This Transportation Service Agreement (Agreement) is entered into by Great Lakes Gas Transmission Limited Partnership (Transporter) and ANR PIPELINE COMPANY (Shipper). WHEREAS, Shipper has requested Transporter to transport Gas on its behalf and Transporter represents that it is willing to transport Gas under the terms and conditions of this Agreement. NOW, THEREFORE, Transporter and Shipper agree that the terms below constitute the transportation service to be provided and the rights and obligations of Shipper and Transporter. 1. EFFECTIVE DATE: November 01, 2016 2. CONTRACT IDENTIFICATION: FT18150 3. RATE SCHEDULE: FT 4. SHIPPER TYPE: Interstate Pl 5. STATE/PROVINCE OF INCORPORATION: Delaware 6. TERM: November 01, 2014 to October 31, 2017 7. EFFECT ON PREVIOUS CONTRACTS: This Agreement supersedes, cancels and terminates, as of the effective da", "labels": [[78, 142, "DOC_NAME"], [212, 260, "PARTY"], [262, 273, "PARTY"], [279, 299, "PARTY"], [301, 308, "PARTY"], [320, 327, "PARTY"], [342, 353, "PARTY"], [389, 400, "PARTY"], [514, 525, "PARTY"], [530, 537, "PARTY"], [652, 659, "PARTY"], [664, 675, "PARTY"]]}
{"id": 454, "text": "Exhibit 10.9 SUPPLY AGREEMENT between CREMER OLEO GmbH & Co KG, Glockengiesserwall 3, 20095 Hamburg, Germany — hereinafter referred to as Cremer — and Ultragenyx Pharmaceutical Inc, 60 Leveroni Court, Suite 200, Novato, California 94949, United States of America — hereinafter referred to as Ultragenyx — ­ each party also referred to as a “Party” and jointly as the “Parties” – Preamble Whereas, Cremer is a producer of oleo chemical products; Whereas, Ultragenyx is a biotechnology company committed to bringing life-enhancing therapeutics for patients with rare and ultra-rare genetic diseases, also known as orphan diseases, to market; Whereas, the Parties desire that Cremer supplies to Ultragenyx the product Triheptanoin (hereinafter also referred to as the “Product”) in bulk form pursuant to the terms and conditions of this Agreement; Whereas, Ultragenyx intends to process the Product into a pharmaceutical product in the meaning of Sec. 2 German Pharmaceuticals Act (Arzneimittelgesetz—AM", "labels": [[13, 29, "DOC_NAME"], [38, 62, "PARTY"], [138, 144, "PARTY"], [151, 180, "PARTY"], [292, 302, "PARTY"], [397, 403, "PARTY"], [454, 464, "PARTY"], [673, 679, "PARTY"], [692, 702, "PARTY"]]}
{"id": 459, "text": "Exhibit 2.6 FINAL VERSION FORM OF MANUFACTURING AND SUPPLY AGREEMENT BY AND BETWEEN PFIZER INC. AND UPJOHN INC. DATED AS OF [●] Source: UPJOHN INC, 10-12G, 1/21/2020 TABLE OF CONTENTS Page 1.  DEFINITIONS 1 2.  SUPPLY OF PRODUCT 13 2.1   Agreement to Supply 13 2.2   Use of Facility, Equipment, Molds and Tooling 15 2.3   Capacity 15 2.4   Forecasts and Purchase Orders 16 2.5   Failure to Supply 19 2.6   Delivery; Risk of Loss 21 2.7   Procurement of Materials 22 2.8   Product Samples 23 2.9   Storage 23 2.10  Transitional Support 24 3.  PRICE; PAYMENT; PRICE ADJUSTMENTS; TAXES 26 3.1   Price 26 3.2   Price Adjustment 27 3.3   Cost Improvement 30 3.4   Price Review and Audit Procedure 31 3.5   Invoices and Payment 32 3.6   Taxes 33 3.7   No Duplicative Payments 35 4.  MANUFACTURING STANDARDS AND QUALITY ASSURANCE 35 4.1   Quality Agreement 35 4.2   Manufacturing Standards 35 4.3   Manufacturing Changes 35 4.4   Pest Control 36 4.5   Legal and Regulatory Filings and Requests 36 4.6   Qual", "labels": [[34, 68, "DOC_NAME"], [84, 95, "PARTY"], [100, 111, "PARTY"]]}
{"id": 461, "text": "EXHIBIT 10.3 JOINT VENTURE CONTRACT CHAPTER 1 GENERAL PROVISIONS In accordance with the Law of the People's Republic of China on Joint Ventures Using Chinese and Foreign Investment (the \"Joint Venture Law\") and other relevant Chinese laws and regulations, Fengfan Group Limited Liability Company and Valence Technology Inc., in accordance with the principle of equality and mutual benefit and through friendly consultations, agree to jointly invest to establish a joint venture enterprise in Baoding City, Hebei Province of the People's Republic of China. CHAPTER 2 PARTIES TO THIS CONTRACT Article 1 Parties to this Joint Venture Contract 1. Baoding Fengfan Group Limited Liability Company (hereinafter referred to as Party A), established and existing under the laws of the People's Republic of China (\"PRC\"), registered with the No. 1306001000338 Business License in China. Legal address: 8 Fuchang Road, Baoding City, Hebei Province, PRC Legal Representative of Party A: Name: Mengli Chen Positio", "labels": [[13, 35, "DOC_NAME"], [617, 639, "DOC_NAME"], [643, 690, "PARTY"], [719, 726, "PARTY"]]}
{"id": 462, "text": "Exhibit 10.14 [* * *] = Certain confidential information contained in this document, marked by brackets, has been omitted and filed separately with the Securities and Exchange Commission pursuant to Rule 406 of the Securities Act of 1933, as amended. MANUFACTURING AND SUPPLY AGREEMENT DATED AS OF January 1, 2013 BETWEEN VAPOTHERM, INC. AND MEDICA, S.p.A. TABLE OF CONTENTS Page ARTICLE 1 SALE AND PURCHASE 1 1.1 Supply of Cartridge 1 1.2 [* * *] 1 1.3 Purchase of Cartridge 1 ARTICLE 2 FORECASTS; INVENTORY 1 2.1 Rolling Forecasts 1 2.2 Inventory 2 ARTICLE 3 ORDERS, SHIPMENT, AND PAYMENT 2 3.1 Price 2 3.2 Purchase Orders 2 3.3 Delivery 3 3.4 [* * *] 3 3.5 Delay in Delivery 3 3.6 Delivery Default Rights 3 3.7 Invoices and Payment Terms 3 3.8 Delay in Payment 4 ARTICLE 4 QUALITY OF THE CARTRIDGE 4 4.1 Conformity with Specifications 4 4.2 Conditions to Rejection 4 4.3 Rejection 4 4.4 Nonconformity Default Rights 5 4.5 Acceptance of Cartridges 5 4.6 Quality Monitoring 5 ARTICLE 5 PRODUCTION PR", "labels": [[251, 285, "DOC_NAME"], [322, 337, "PARTY"]]}
{"id": 466, "text": "Exhibit 10.10 CERTAIN CONFIDENTIAL PORTIONS OF THIS EXHIBIT HAVE BEEN OMITTED AND REPLACED WITH “[*]”. SUCH IDENTIFIED INFORMATION HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM TO THE COMPANY IF DISCLOSED. SUPPLY AGREEMENT by and between MEDIWOUND LTD. and VERICEL CORPORATION May 6, 2019 TABLE OF CONTENTS Page ARTICLE 1 DEFINITIONS 1 ARTICLE 2 SUPPLY OF PRODUCTS 5 2.1 Scope of Agreement 5 2.2 Exclusive Supply 6 2.3 Materials 6 2.4 Labeling 6 2.5 Subcontracting 7 2.6 Facilities 8 2.7 Establishment of Second Source 9 2.8 Forecasting and Ordering 9 2.9 Delivery 11 2.10 Dating 12 2.11 Safety Stock 12 2.12 Non-Conforming Product 12 2.13 Shortages 13 2.14 Supply Failures 13 ARTICLE 3 COMPLIANCE, QUALITY AND ENVIRONMENTAL 14 3.1 Certificates of Analysis; Release 14 3.2 Records 14 3.3 Regulatory Compliance 14 3.4 Audit 15 3.5 Results of Audits and /or Regulatory Inspection 16 3.6 Regulatory Information 16 3.7 Recall 16 3.8 Quali", "labels": [[272, 288, "DOC_NAME"], [304, 318, "PARTY"], [323, 342, "PARTY"]]}
{"id": 468, "text": "Exhibit 10.24 OPERATION AND MAINTENANCE AGREEMENT Dated as of November 3, 2010 10.23 TABLE OF CONTENTS Page ARTICLE I : DEFINITIONS1 ARTICLE II : ENGAGEMENT OF OPERATOR5 2.1 Engagement.. 5 2.2 Independent Contractor. 5 2.3 Owner Cooperation 5 ARTICLE III : TERM, RESIGNATION OR REMOVAL OF OPERATOR5 3.1 Term. 5 3.2 Owner Default. 5 3.3 Operator Default 6 3.4 Cooperation with Owner or Successor Operator 7 3.5 Effect of Termination 7 ARTICLE IV : DUTIES AS OPERATOR7 4.1 Duties as Operator. 7 4.2 Standard of Care.. 11 4.4 Limitation of Authority 12 ARTICLE V : ACCOUNTING, REPORTS, RECORDS12 5.1 Accounting Methods. 12 5.2 Independent Audit. 12 ARTICLE VI : FORCE MAJEURE12 6.1 Procedure.. 12 6.2 Strikes. 13 ARTICLE VII : INSURANCE AND INDEMNIFICATION13 7.1 Operator Insurance. 13 7.2 Contractors 14 7.3 Notice of Claims.. 14 7.4 Mutual Release and Indemnification. 14 ARTICLE VIII : GENERAL PROVISIONS15 8.2 Notices 15 8.3 Rights 16 8.4 Applicable Laws 16 8.5 Rules of Construction. 16 8.6 Governi", "labels": [[223, 228, "PARTY"], [315, 320, "PARTY"]]}
{"id": 477, "text": "Exhibit 10.4 FORM OF TRANSFER AND SERVICING AGREEMENT among VERIZON OWNER TRUST 2020-A, as Issuer, VERIZON ABS LLC, as Depositor and CELLCO PARTNERSHIP d/b/a VERIZON WIRELESS, as Servicer, Marketing Agent and Custodian Dated as of January 29, 2020 Source: VERIZON ABS LLC, 8-K, 1/23/2020 TABLE OF CONTENTS ARTICLE I USAGE AND DEFINITIONS 1 Section 1.1 Usage and Definitions 1 ARTICLE II TRANSFER AND ACQUISITION OF DEPOSITOR TRANSFERRED PROPERTY; REPRESENTATIONS AND WARRANTIES Section 2.1 Transfers of Depositor Transferred Property 1 Section 2.2 Acknowledgement of Further Assignments 3 Section 2.3 Savings Clause 3 Section 2.4 Representations and Warranties About Depositor Transferred Property. 3 Section 2.5 Originators’ Reacquisition and Servicer’s Acquisition of Receivables for Breach of Representations 5 Section 2.6 Originators’ Reacquisition or Servicer’s Acquisition of Bankruptcy Surrendered Receivables 6 ARTICLE III SERVICING OF RECEIVABLES 7 Section 3.1 Engagement 7 Section 3.2 Servi", "labels": [[60, 86, "PARTY"], [91, 97, "PARTY"], [99, 114, "PARTY"], [119, 128, "PARTY"], [133, 174, "PARTY"], [179, 187, "PARTY"], [189, 204, "PARTY"], [209, 218, "PARTY"], [231, 247, "AGMT_DATE"], [256, 271, "PARTY"], [415, 424, "PARTY"], [503, 512, "PARTY"], [667, 676, "PARTY"], [744, 752, "PARTY"]]}
{"id": 479, "text": "MOBILE APPLICATION DEVELOPMENT AGREEMENT (Agreement No: VAL/MAD/PVTINV/DC/190305/1) EDT (Electronic document transmissions) EDT (Electronic document transmissions) shall be deemed valid and enforceable in respect of any provisions of this Contract. As applicable, this agreement shall be:- Incorporate U.S. Public Law 106-229, ‘‘Electronic Signatures in Global and National Commerce Act’’ or such other applicable law conforming to the UNCITRAL Model Law on Electronic Signatures (2001) and ELECTRONIC COMMERCE AGREEMENT (ECE/TRADE/257, Geneva, May 2000) adopted by the United Nations Centre for Trade Facilitation and Electronic Business (UN/CEFACT). EDT documents shall be subject to European Community Directive No. 95/46/EEC, as applicable. Either Party may request hard copy of any document that has been previously transmitted by electronic means provided however, that any such request shall in no manner delay the parties from performing their respective obligations and duties under EDT inst", "labels": [[0, 40, "DOC_NAME"], [56, 59, "PARTY"]]}
{"id": 481, "text": "Exhibit 10.2 SERVICES AND HOSTING AGREEMENT THIS SERVICES AND HOSTING AGREEMENT (this \"Agreement\") is entered into by and between VITALIBIS INC a Nevada C having its principal place of business at 5348 Vegas Drive, Las Vegas, NV 89108 (hereinafter, -Licensee\"), and VOTOCAST, Inc. a California corporation (dba, newkleus), having its principal place of business at PO Box 7302 Newport Beach, CA 92658 (hereinafter, \"VOTOCAST). VOTOCAST and Licensee may also be referred to individually as a \"Party\" and collectively as the \"Parties.\" WHEREAS, VOTOCAST provides certain hosting and technical services, including iOS and Android Mobile Applications, APIs, SDKs and Admin Module (\"Services\"); and WHEREAS, Licensee wishes to engage VOTOCAST, and VOTOCAST desires to be engaged by Licensee, to provide hosting and technical services on the terms and subject to the conditions set forth below. NOW. THEREFORE, in consideration of the promises, benefits, and covenants set forth herein, the Parties hereby ", "labels": [[13, 43, "DOC_NAME"], [49, 79, "DOC_NAME"], [130, 143, "PARTY"], [249, 259, "PARTY"], [266, 280, "PARTY"]]}
{"id": 483, "text": "Exhibit 4.36 DEVELOPMENT AGREEMENT between LEO PHARMA A/S of Industriparken 55, DK-2750 Ballerup, Denmark (hereinafter referred to as \"LEO\") and GALEN (CHEMICALS) LIMITED of 4 Adelaide Street, Dun Laoghaire, Co. Dublin, Ireland (hereinafter referred to as \"GALEN\"). Capitalized terms not otherwise defined herein shall have the meanings set forth in Article I of this Agreement. WHEREAS Bristol-Myers Squibb Company (BMS) has entered into a co-promotion agreement with GALEN regarding Dovonex(R) Product in the Territory (the \"Co-promotion Agreement\"). WHEREAS GALEN and BMS have entered into an option agreement (the \"Option Agreement\") in which GALEN has options to acquire all of BMS's rights and to assume BMS's obligations (the \"Option\") under the agreement dated September 28, 1989 between BMS (as successor to E.R. Squibb & Sons Inc.) and LEO, as amended July 6, 1992 and April 8, 1993 and as of the date hereof and the Product Supply Agreement between Bristol-Myers Squibb Company and LEO dat", "labels": [[13, 34, "DOC_NAME"], [43, 57, "PARTY"], [135, 138, "PARTY"], [145, 170, "PARTY"], [257, 262, "PARTY"], [469, 474, "PARTY"], [561, 566, "PARTY"], [647, 652, "PARTY"], [846, 849, "PARTY"]]}
{"id": 497, "text": "Exhibit 10.1 [*] Text omitted for confidential treatment. The redacted information has been excluded because it is both (i) not material and (ii) would be competitively harmful if publicly disclosed. GLOBAL MASTER SUPPLY AGREEMENT This Global Master Supply Agreement (\"Agreement\" or \"Contract\") is between ExxonMobil Chemical Company, a division of Exxon Mobil Corporation (\"Seller\"),on behalf of itself and in the interest of the ExxonMobil affiliates listed on Attachment B (each an \"ExxonMobil Selling Affiliate\" or \"EMCC/A\" or collectively, \"ExxonMobil Selling Affiliates\"), and West Pharmaceutical Services, Inc. (\"Buyer\"), on behalf of itself and the Buyer affiliates listed on Attachment C (each a \"Buyer Affiliate\" or “West/A\" or collectively, \"Buyer Affiliates\"). PRODUCTS, QUANTITY, PRICE In accordance with the provisions of this Agreement, ExxonMobil Selling Affiliates agree to sell to Buyer Affiliates, and Buyer Affiliates agree to purchase from ExxonMobil Selling Affiliates, the foll", "labels": [[200, 230, "DOC_NAME"], [236, 266, "DOC_NAME"], [306, 333, "PARTY"], [375, 381, "PARTY"], [384, 578, "PARTY"], [583, 617, "PARTY"], [620, 625, "PARTY"], [657, 662, "PARTY"], [706, 711, "PARTY"], [753, 758, "PARTY"], [899, 904, "PARTY"]]}
{"id": 503, "text": "EXHIBIT 99.4 DATED 15TH DECEMBER 2001 CHINA ECONOMIC INFORMATION SERVICE OF XINHUA NEWS AGENCY AND XINHUA FINANCIAL NETWORK LIMITED CONTENT LICENSE AGREEMENT SUPPLEMENT TO THE EXCLUSIVE BROADCASTING AGREEMENT BAKER & McKENZIE 14th Floor Hutchison House 10 Harcourt Road Hong Kong Tel: 2846-1888 Fax: 2845-0476 CONTENT Clause Page 1. Definitions and Interpretation....................................... 1 2. Grant of Rights...................................................... 2 3. Delivery of Content.................................................. 3 4. Consideration........................................................ 3 5. Representations and Warranties....................................... 4 6. Indemnity............................................................ 4 7. Term................................................................. 5 8. Termination.......................................................... 5 9. Further Assurance..................................................", "labels": [[38, 94, "PARTY"], [99, 131, "PARTY"]]}
{"id": 507, "text": "Exhibit 10.2 CERTAIN INFORMATION (INDICATED BY ASTERISKS) HAS BEEN OMITTED FROM THIS DOCUMENT BECAUSE IT IS NOT MATERIAL AND WOULD LIKELY CAUSE COMPETITIVE HARM TO THE REGISTRANT IF PUBLICLY DISCLOSED. Zogenix Inc. and Nippon Shinyaku Company Ltd. Distributorship Agreement US-DOCS\\105216871.19 Source: ZOGENIX, INC., 10-Q, 5/9/2019 Table of Contents Article 1. Definitions Article 2. Grant of Rights 2.1 Grant of Rights to Distributor 2.2 Sub-distribution by Distributor 2.3 Supply of Product for Distributorship 2.4 No Other Rights; Other Limitations 2.5 Non-Compete Covenant 2.6 No Activities Outside the Territory or Field Article 3. Governance 3.1 Joint Steering Committee 3.2 Expenses 3.3 Alliance Managers 3.4 Scope of Governance Article 4. Development and Regulatory Activities 4.1 Nonclinical and Clinical Studies and CMC Requirements 4.2 Regulatory Activities 4.3 Distributor’s Right to Use and Reference 4.4 Zogenix’s Right to Use and Reference 4.5 Adverse Event Reporting 4.6 Drug Safety ", "labels": [[202, 209, "PARTY"], [248, 273, "DOC_NAME"], [303, 316, "PARTY"], [424, 435, "PARTY"], [460, 471, "PARTY"], [498, 509, "PARTY"], [874, 885, "PARTY"]]}
{"id": 509, "text": "Exhibit 10.10 Road Transportation Agreement Party A (Shipper): ZTO Express Co., Ltd. Address: Building 1, No. 1685, Huazhi Road, Huaxin Twon, Qingpu District, Shanghai Party B (Carrier): Tonglu Tongze Logistics Ltd. Address: 12 Floor, HSBC Tower, Yinchun South Road, Tonglu County, Zhejiang Province Due to the need for logistics business, Party A and Party B enter into this Road Transportation Agreement (this “Agreement”), in which Party A pays the freight and Party B provides parcel transportation services to Party A. In accordance with relevant laws and regulations, Party A and Party B have sufficiently negotiated the specific matters and voluntarily reached the following Agreement based on equality, reciprocity and integrity. This Agreement is to be complied by both Parties. 1. Party B shall provide parcel transportation services on highway line-haul routes based on the needs of Party A. 2. Period of transportation services: this Agreement is valid for an indefinite term. Subsequent ", "labels": [[14, 43, "DOC_NAME"], [44, 84, "PARTY"], [168, 215, "PARTY"]]}
{"id": 72, "text": "AMENDMENT NO. 1 TO STREMICK’S HERITAGE FOODS, LLC and PREMIER NUTRITION CORPORATION MANUFACTURING AGREEMENT This Amendment No. 1 (the “Amendment”), entered into by and between Stremick’s Heritage Foods, LLC (“Heritage”) Premier Nutrition Corporation (“Premier”) is effective as of June 11, 2018 (“Amendment Effective Date”) and amends that certain Manufacturing Agreement between Heritage and Premier dated July 1, 2017 (“Agreement”). Heritage and Premier are each referred to herein as a “Party” and collectively as the “Parties.” WHEREAS, Heritage and Premier entered into the Agreement; WHEREAS, the Parties wish to amend the Agreement in accordance with the terms and conditions set forth herein. NOW, THEREFORE, in consideration of the promises and of the mutual covenants, representations and warranties contained in the Agreement and set forth herein, the Parties hereby agree that the following changes shall be made to the Agreement: 1. The Parties hereby agree to remove Section 2(c) in its", "labels": []}
{"id": 73, "text": "AMENDMENT NO. 2 TO STREMICK’S HERITAGE FOODS, LLC and PREMIER NUTRITION CORPORATION MANUFACTURING AGREEMENT This Second Amendment (“Second Amendment”), entered into by and between Stremick’s Heritage Foods, LLC, (“Heritage”), Premier Nutrition Corporation (“Premier”) is effective as of October 1, 2018 (“Second Amendment Effective Date”) and amends that certain Manufacturing Agreement between Heritage and Premier dated July 1, 2017 (“Agreement”). Heritage and Premier are each referred to herein as a “Party” and collectively as the “Parties”. WHEREAS, PREMIER and HERITAGE entered into the Agreement; WHEREAS, the Parties wish to extend and amend the Agreement in accordance with the terms and conditions set forth herein; and WHEREAS, HERITAGE [*] desires to produce Products packaged in aseptic plastic bottles (“Bottled Products”) for PREMIER in accordance with the terms and conditions set forth in the Agreement, as well as those set forth herein, [*]; and NOW, THEREFORE, in consideration o", "labels": []}
{"id": 74, "text": "AMENDMENT NO. 3 TO STREMICK’S HERITAGE FOODS, LLC and PREMIER NUTRITION CORPORATION MANUFACTURING AGREEMENT This Amendment No. 3 (the “Third Amendment”), entered into by and between Stremicks Heritage Foods, LLC (“Heritage”) Premier Nutrition Corporation (“Premier”) is effective as of July 3, 2019 (“Third Amendment Effective Date”) and amends that certain Manufacturing Agreement between Heritage and Premier dated July 1, 2017 as amended (“Agreement”). Heritage and Premier are each referred to herein as a “Party” and collectively as the “Parties.” WHEREAS, Heritage and Premier entered into the Agreement; WHEREAS, the Parties wish to amend the Agreement in accordance with the terms and conditions set forth herein. NOW, THEREFORE, in consideration of the promises and of the mutual covenants, representations and warranties contained in the Agreement and set forth herein, the Parties hereby agree that the following changes shall be made to the Agreement: 1. The Parties hereby agree to remov", "labels": []}
{"id": 97, "text": "SCHEDULE B Customization Schedule This Customization Schedule is attached to the Software License, Customization and Maintenance Agreement (the “Agreement”) executed by and between Bank of America, N.A. (“Bank of America”) and <<enter Company Name» (“Supplier”). The Customizations identified hereunder shall be subject to the terms and conditions of that Software License, Customization and Maintenance Agreement referenced above. Bank of America wishes to obtain the Customizations herein defined, and Supplier wishes to delivery those Customizations, on the terms and conditions of the Agreement and this Customization Schedule. 1. The Customizations shall fulfill or exceed all of the functional, performance and other specifications described in the Program Materials and the documents prepared either by Bank of America or Supplier pursuant to this Agreement. as indicated below. No later than <<enter Customization Documents Delivery Date>>, Supplier shall deliver to Bank of America the docum", "labels": []}
{"id": 99, "text": "[*] = CONFIDENTIAL TREATMENT REQUESTED SCHEDULE A Product License Schedule FORM This Product License Schedule is issued pursuant to the Software License, Customization and Maintenance Agreement (the “Agreement”) executed by and between Bank of America, N.A. (“Bank of America”) and Cardlytics, (“Supplier”) and incorporates by reference all of the terms and conditions of the Agreement. TERM FOR ORDERING A. Software This Schedule constitutes an Order in accordance with the terms of the Agreement. B. Payment Schedule for Source Code delivery as outlined in Section 2.7 • Beginning three (3) years after the General Services Agreement Effective Date, the Supplier Software version in place one (1) yearfollowing the Service reaching 10,000,000 Users $[*] • The latest commercially available version, or earlier versions at Bank of America’s option, of the Supplier Software: • Beginning 3 years after the General Services Agreement Effective Date or one (1) year following the Service reaching 10,00", "labels": []}
{"id": 181, "text": "AMENDMENT NO. 1 Dated as of November 11, 2005 Reference is hereby made to that certain fully executed Wireless Content License Agreement Number 12965 dated as of December 16, 2004 (“Agreement”), between TWENTIETH CENTURY FOX LICENSING & MERCHANDISING, division of Fox Entertainment Group, Inc. (“Fox”), as Administrator for Twentieth Century Fox Film Corporation (“Trademark Licensor”) and Glu Mobile, Inc. f/k/a Sorrent, Inc. (“Licensee”). The parties agree to modify the Agreement as follows: 1. PARTIES (a) FOX ASSIGNMENT OF AGREEMENT: Pursuant to Twentieth Century Fox Licensing and Merchandising’s assignment of rights and obligations through an assignment dated as of October 1, 2005 by and between Twentieth Century Fox Licensing and Merchandising and Fox Mobile Entertainment Inc., Fox Mobile Entertainment, Inc. is hereby substituted for Twentieth Century Fox Licensing and Merchandising as “Fox” under the Agreement. (b) LICENSEE CHANGE OF NAME: The parties hereby acknowledge that Licensee", "labels": []}
{"id": 182, "text": "AMENDMENT NO. 2 Dated as of March 27, 2006 Reference is hereby made to that certain fully executed Wireless Content License Agreement Number 12965 dated as of December 16, 2004, as amended November 11, 2005, (“Agreement”), between Fox Mobile Entertainment, Inc. (“Fox”), as Administrator for Twentieth Century Fox Film Corporation (“Trademark Licensor”) and Glu Mobile, Inc. f/k/a Sorrent, Inc. (“Licensee”). The parties agree to modify the Agreement as follows: A. “ICE AGE 2” a/k/a “ICE AGE: THE MELTDOWN” AUDIO AND VIDEO WIRELESS PRODUCTS: 1. Grant of Rights: Fox grants to Licensee a limited, non-exclusive right and license to distribute the following Wireless Products in connection with the Property “ICE AGE: THE MELTDOWN” in the United States: (A) 2 Scrat voicetones; (B) 2 John Leguizamo voicetones; and (C) 3 premium videos. Fox also grants Licensee a limited, non-exclusive right and license to distribute the following Wireless Products in connection with the Property “ICE AGE 2” outsid", "labels": []}
{"id": 183, "text": "AMENDMENT NO. 3 Dated as of February 19, 2007 Reference is hereby made to that certain fully executed Wireless Content License Agreement Number 12965 dated as of December 16, 2004, as amended November 11, 2005 and March 27, 2006 (the “Agreement”), between Fox Mobile Entertainment, Inc. (“Fox”), as Administrator for Twentieth Century Fox Film Corporation, and Glu Mobile Inc. (“Licensee”). The parties agree to modify the Agreement as follows: 1. EXTENSION OF TERM: The first paragraph of Section 4 of the Agreement is hereby deleted in its entirety and replaced with the following: “TERM: The rights granted hereunder shall be effective as of the Effective Date and shall expire on December 31, 2006 (the “Term”); provided, however, that with respect to each Property, including Robots, Kingdom of Heaven, Mr. and Mrs. Smith, In Her Shoes, Idiocracy (Oww My Balls) and Ice Age II, all right and licenses granted herein will continue in full force and effect until March 31, 2008.” 2. NOTICE PROVISI", "labels": []}
{"id": 236, "text": "Exhibit 10.15 THE JOINT CORP. FRANCHISE AGREEMENT TABLE OF CONTENTS SECTION PAGE 1. INTRODUCTION 1 2. GRANT OF FRANCHISE 2 2.1 Term; Reference to Exhibit 1 2 2.2 Full Term Performance 3 2.3 Management Agreement with Professional Corporation – Non-Licensed Franchisees 3 2.4 Waiver of Management Agreement 4 2.5 Selection of Premises; No Protected Territory; Reservation of Rights 5 2.6 Renewal of Franchise 5 2.7 Personal Guaranty by Principal Owners; Reference to Exhibit 2 6 3. DEVELOPMENT AND OPENING OF THE FRANCHISE 6 3.1 Site Approval; Lease or Purchase of Premises; Opening Timeline; Reference to Exhibit 3 6 3.2 Prototype and Construction Plans and Specifications 7 3.3 Development of the Franchise 7 3.4 Computer System 8 3.5 Equipment, Furniture, Fixtures, Furnishings and Signs 9 3.6 Franchise Opening 9 4. TRAINING 9 4.1 General Manager 9 4.2 Training 10 5. GUIDANCE; OPERATIONS MANUAL 11 5.1 Guidance and Assistance 11 5.2 Operations Manual 12 5.3 Modifications to System 12 5.4 Advisory", "labels": []}
{"id": 317, "text": "1 EXHIBIT 10.17 [E.PIPHANY Logo] OUTSOURCING AGREEMENT This ASP and Outsourcing Agreement (\"Agreement\") is entered into as of this 31 day of July, 2000 (\"Effective Date\") by and between E.PIPHANY, INC., a Delaware corporation (\"E.piphany\"), whose principal place of business 1900 South Norfolk Street, Suite 310, San Mateo, California 94403 and HIGH SPEED NET SOLUTIONS, INC. (\"HSNS\"), whose principal place of business is 434 Fayetteville Street, St. Suite 2120, Raleigh, NC 27601. 1. LICENSE 1.1 OUTSOURCING LICENSE. Subject to the terms of this Agreement and Scope of Use and only within the Market and Territory, E.piphany grants HSNS a nonexclusive, nontransferable, non-sublicensable right to (i) use and combine the Application with the Outsourcing Application and other software products for the purpose of providing, to Outsourcing Customers, the services described in Exhibit B as the Outsourcing Services; and (ii) use the Documentation provided with the Application in support of the Appl", "labels": []}
{"id": 351, "text": "SeattleSoftwareDevelopers SOFTWARE DEVELOPMENT AGREEMENT PELICAN DELIVERS iOS APPLICATION ENHANCEMENTS & WEB APPLICATION DEVELOPMENT PHASE 1 4 102nd Ave NE Suite 300 Bellevue, WA 98004 (425) 256-2815 julian@seattlesoftwaredevelopers.com www .seattlesoftwaredeveIopers.com 1 Source: PELICAN DELIVERS, INC., S-1, 2/11/2020 STATEMENT OF WORK - APPENDIX A This Statement of Work is issued to and made part of that Software Development Agreement executed by and between Developer and Client on the Effective Date (the Agreement). Any word or phrase not otherwise defined in this Appendix will have the meaning ascribed in the Agreement. 1. Project Overview The purpose of this project is to develop additional features for the Pelican Delivers software. This includes POS integration, Google Maps API, payment processing features, ID verification, reporting, driver app improvement and workflow, and a front facing web application for customers to find, order, and receive products via deliver or pickup. ", "labels": []}
{"id": 2, "text": "EXHIBIT 10.13 JOINT VENTURE AGREEMENT Collectible Concepts Group, Inc. (\"CCGI\") and Pivotal Self Service Tech, Inc. (\"PVSS\"), (the \"Parties\" or \"Joint Venturers\" if referred to collectively, or the \"Party\" or Joint Venturer\" if referred to singularly), by this Agreement associate themselves as business associates, and not as partners, in the formation of a joint venture (the \"Joint Venture\"), for the purpose of engaging generally in the business provided for by terms and provisions of this Agreement. 1. Name of the Joint Venture. The name of the Joint Venture will be MightyCell Batteries, and may sometimes be referred to as \"MightyCell\" or the \"Joint Venture\" in this Agreement. The principal office and place of business shall be located in 1600 Lower State Road, Doylestown, PA 18901. 2. Scope of the Joint Venture Business. The Joint Venture is formed for the purpose of engaging generally in the business of marketing batteries and related products, (the \"Products\") that include the disp", "labels": []}
{"id": 103, "text": "Exhibit 10.33 EXECUTION VERSION CONFIDENTIAL DOMAIN NAME AND CONTENT LICENSE AGREEMENT This Domain Name and Content License Agreement (the “Agreement”) is made and entered into, by and between Beijing SINA Internet Information Service Co., Ltd. ( ), a limited liability company organized under the laws of the People’s Republic of China (hereinafter “Licensor”) and Beijing Yisheng Leju Information Services Co., Ltd., a limited liability company organized under the laws of the People’s Republic of China (“Licensee” and together with Licensor, the “Parties” and each a “Party”) and is made effective as of the Effective Date (defined below). RECITALS WHEREAS, SINA Corporation, a company organized under the laws of the Cayman Islands (“SINA”), and CRIC Holdings Limited, a company organized under the laws of the Cayman Islands (“CRIC”), entered into that certain Share Purchase Agreement dated July 23, 2009 (the “Share Purchase Agreement”), pursuant to which SINA subscribes from CRIC the Subscr", "labels": []}
{"id": 140, "text": "Exhibit 10.16 EL POLLO LOCO® FRANCHISE DEVELOPMENT AGREEMENT Dated: Territory: Developer: (Disclosure Document Control No. 032619) TABLE OF CONTENTS 1.DEVELOPMENT RIGHTS IN TERRITORY. 4 2.LIMITATION ON DEVELOPMENT RIGHTS. 5 3.DEVELOPMENT FEE. 9 4.TERM OF DEVELOPMENT AGREEMENT. 10 5.TERRITORY CONFLICTS. 10 6.PROPRIETARY RIGHTS OF EL POLLO LOCO. 11 7.INSURANCE AND INDEMNIFICATION. 11 8.TRANSFER OF RIGHTS. 13 9.ACKNOWLEDGMENT OF SELECTED TERMS AND PROVISIONS OF THE FRANCHISE AGREEMENT. 14 10.TERMINATION BY DEVELOPER; EXPIRATION DATE. 14 11.EVENTS OF DEFAULT. 15 12.EFFECT OF TERMINATION. 16 13.NON-WAIVER. 17 14.INDEPENDENT CONTRACTOR AND INDEMNIFICATION. 17 15.ENTIRE AGREEMENT. 17 16.DISPUTE RESOLUTION 18 17.SEVERABILITY. 19 18.APPLICABLE LAW; CHOICE OF FORUM; WAIVER OF JURY TRIAL. 19 19.DOCUMENT INTERPRETATION. 19 20.COVENANT NOT TO COMPETE. 20 21.NOTICES. 21 22.SECTION HEADINGS. 21 23.ACKNOWLEDGMENTS. 21 24.COUNTERPARTS. 22 Source: EL POLLO LOCO HOLDINGS, INC., 10-K, 3/6/2020 EXHIBITS EX", "labels": []}
{"id": 154, "text": "Exhibit 10.2 EXECUTION COPY *Text Omitted and Filed Separately with the Securities and Exchange Commission Confidential Treatment Requested Under 17 C.F.R. Sections 200.80(b)(4) and 240.24b-2 Collaboration Agreement This Agreement is entered into with effect as of the Effective Date (as defined below) by and between F. Hoffmann-La Roche Ltd with an office and place of business at Grenzacherstrasse 124, 4070 Basel, Switzerland (“Roche Basel”) and Hoffmann-La Roche Inc. with an office and place of business at 150 Clove Road, Suite 8, Little Falls, New Jersey 07424, U.S.A. (“Roche US”; Roche Basel and Roche US together referred to as “Roche”) on the one hand and Foundation Medicine, Inc. with an office and place of business at 150 Second Street, Cambridge, Massachusetts 02141 (“FMI”) on the other hand. Table of Contents 1. Definitions 7 1.1 Affiliate 7 1.2 Agreement 7 1.3 Agreement Term 7 1.4 [...*...] ctDNA [...*...] 7 1.5 Applicable Law 7 1.6 Approved Assay 7 1.7 Background IP 7 1.8 Bus", "labels": []}
{"id": 156, "text": "Exhibit 10.17 Supply Agreement - FUSION CERTAIN CONFIDENTIAL PORTIONS OF THIS EXHIBIT HAVE BEEN OMITTED AND REPLACED WITH “[*]”. SUCH IDENTIFIED INFORMATION HAS BEEN EXCLUDED FROM THIS EXHIBIT BECAUSE IT IS (I) NOT MATERIAL AND (II) WOULD LIKELY CAUSE COMPETITIVE HARM TO THE COMPANY IF DISCLOSED. SUPPLY AGREEMENT (“Supply Agreement”) effective as of the date of last signing (“Effective Date”) between Centre for Probe Development and Commercialization, a not-for-profit research and services institution with offices located at McMaster University, Nuclear Research Building, 1280 Main Street West, Hamilton, Ontario, Canada, L8S 4K1, (“CPDC”), and FUSION Pharmaceuticals Inc. (“FUSION”), having a place of business at 270 Longwood Road South, Hamilton, Ontario, Canada, L8P 0A6, (together the “Parties” each a “Party”). This document defines the terms and conditions under which CPDC will provide FUSION the Product outlined in this Supply Agreement. This Supply Agreement is conducted under the ", "labels": []}
{"id": 170, "text": "Exhibit 10.6 Goosehead Insurance Agency, LLC Franchise Agreement Exhibit A Declarations Page 1 1.2 The “Approved Location” under this Agreement will be:.2 4.1 You elect to pay the Initial Franchise Fee in one of the following ways: (check only one): ☐ In its entirety at the time you enter into this Agreement, in which case the amount of the Initial Franchise Fee shall be: ($ ). ☐ You shall pay a portion of the Initial Franchise Fee at the time you enter into this Agreement in the amount of ($ ), and shall pay the remaining portion of ($ ), plus interest, according to the terms of the 60-month Promissory Note attached to this Agreement as Exhibit I. 3 4.2 The “Commencement Date” will be:.Initials Franchisee Franchisor Goosehead Insurance Agency, LLC Franchise Agreement TABLE OF CONTENTS Section Title Page# Recitals 2 1 Grant 2 2 Term And Renewal 3 3 Our Duties 4 4 Fees; Sales Reporting 6 5 Franchised Business Commencement 9 6 Operating Principal, Personnel, And Training 11 7 Purchase of", "labels": []}
{"id": 185, "text": "Exhibit 10.6 EXECUTION COPY MEDIA LICENSE AGREEMENT THIS MEDIA LICENSE AGREEMENT (this “Agreement”) is made and effective as of the date of the Closing (as defined in the Merger Agreement (as defined below)) (the “Effective Date”), between NATIONAL FOOTBALL MUSEUM, INC., an Ohio non-profit corporation, doing business as Pro Football Hall of Fame (“PFHOF”), HOF Village Media Group, LLC (the “Village Media Company”), a Delaware limited liability company that is a wholly-owned subsidiary of HOF Village, LLC, a Delaware limited liability company (“HOFV”) and, solely for purposes of Section 4.5, HOFV; each a “Party” and collectively, the “Parties”. RECITALS A. In connection with a Master Transaction Agreement dated December 11, 2018, as amended of even date herewith and as it may be amended or otherwise modified from time to time (the “Master Transaction Agreement”), by and among the Parties and certain other parties, as well as other agreements referenced in the Master Transaction Agreemen", "labels": []}
{"id": 192, "text": "[INITIALS ILLEGIBLE] [INITIALS ILLEGIBLE] 20.3.98 30.4.98 5 SCHEDULE 3 Project Managers The Publishers: Project Manager - Ian Bannerman Blackwell Science Ltd Osney Mead Oxford OX2 0EL UK e-mail: ian.bannerman@blacksci.co.uk tel: +44 (0)1865 206101 Deputy Project Manager - Martin Clutterbuck Blackwell Science Ltd Osney Mead Oxford OX2 0EL UK e-mail: martin.clutterbuck@blacksci.co.uk tel: +44 (0)1865 206110 Deputy Project Manager - Anders Geertsen Munksgaard International Publishers Ltd 35 Norre Sogade, P.O. Box 2148 1016 Copenhagen K Denmark e-mail: ag@mail.munksgaard.dk tel: +45 77 33 31 03 HealthGate: Project Manager - Mark Israel HealthGate 380 Pleasant Street Suite 230 Malden MA 02148 USA tel: 781 321 6000 Ext 248 e-mail: misra@healthgate.com Deputy Project Manager - Rick Lawson HealthGate 380 Pleasant Street Suite 230 Malden MA 02148 USA tel: 781 321 6000 Ext 211 e-mail: lawson@healthgate.com [INITIALS ILLEGIBLE] [INITIALS ILLEGIBLE] 20.3.98 30.4.98 6 SCHEDULE 4 3 SCHEDULE 4 ESCROW", "labels": []}
{"id": 196, "text": "FRANCHISE AGREEMENT HOMEWOOD SUITES BY HILTON STRATFORD (Stratford, Connecticut) TABLE OF CONTENTS 1.0 DEFINITIONS 1 2.0 GRANT OF LICENSE 6 2.1 Non-Exclusive License 6 2.2 Reserved Rights 7 3.0 TERM 7 4.0 OUR RESPONSIBILITIES 7 4.1 Training 7 4.2 Reservation Service 7 4.3 Consultation 7 4.4 Marketing 7 4.5 Inspections/Compliance Assistance 8 4.6 Manual 8 4.7 Equipment and Supplies 9 5.0 YOUR RESPONSIBILITIES 9 5.1 Operational and Other Requirements 9 6.0 HOTEL WORK 11 6.1 Necessary Consents 11 6.2 Initial Hotel Work 12 6.3 Commencement and Completion of the Hotel Work 12 6.4 Opening the Hotel Under This Agreement 12 6.5 Performance of Agreement 13 6.6 Hotel Refurbishment and Room Addition 13 7.0 STAFF AND MANAGEMENT OF THE HOTEL 14 8.0 PAYMENT OF FEES 14 8.1 Monthly Fees 14 8.2 Calculation and Payment of Fees 14 8.3 Other Fees 15 8.4 Taxes 15 8.5 Application of Fees 15 9.0 PROPRIETARY RIGHTS 15 9.1 Our Proprietary Rights 15 9.2 Trade Name, Use of the Marks 15 9.3 Use of Trade Name and ", "labels": []}
{"id": 214, "text": "EXHIBIT 10.14 SOFTWARE HOSTING AGREEMENT This Software Hosting Agreement (the \"Agreement\") is entered into and effective as of the later of the two signature dates below (the \"Effective Date\") INKTOMI CORPORATION (\"Inktomi\"), a California corporation, 1900 South Norfolk Street, Suite 110, San Mateo, California 94403, and MICROSOFT CORPORATION (\"Microsoft\"), a Washington Corporation, One Microsoft Way, Redmond, Washington 98052-6399, with reference to the facts set forth in the Recitals below. Recitals A. Inktomi develops and markets computer software products, including without limitation a \"search engine\" software for searching and indexing information accessible through the Internet. B. Microsoft develops, manufactures, distributes and markets computer software products and services. C. Pursuant to that certain Software Development Agreement between the parties executed as of the Effective Date (the \"Software Development Agreement\"), Inktomi is customizing its Internet search engine ", "labels": []}
{"id": 217, "text": "FRANCHISE AGREEMENT TABLE OF CONTENTS I. INTRODUCTION II. AGREEMENT 1. Definitions 2. Franchise Grant; Term 2.1 Grant 2.2 Term 2.3 No Renewal Right: No Exclusivity 2.4 Continuous Operation 2.5 Best Efforts 3. Consideration for Franchise Grant 4. Management, Control and Corporate Documents of Franchisee 4.1 Managing Director 4.2 Director of Operations 4.3 Substitute Director of Operations 4.4 Restaurant Manager 4.5 Corporate Documents 4.5.1 Single Purpose Entity 4.5 2 Managing Director's Authority 4.5.3 Issuance and Transfer of Shares 4.5.4 Amendments 5. Standards and Uniformity 5.1 Strict Compliance 5.2 The MOD Manual 5.3 Building and Premises 5.3.1 Initial Construction 5 3 2 Repair and Maintenance 5 3.3 Current Image 5.4 Signs 5.5 Equipment 5.6 Vending Machines, Etc. 5 7 Menu Service and Hygiene 5.8 Hours of Operations 5.9 Uniforms 5.10 Advertising and Promotion Materials 5.11 Interference with Employment Relations of Others 5.12 Improvements 5.13 Self-Audit 5.14 Health Problems 5.15 ", "labels": []}
{"id": 220, "text": "Exhibit 10.1 Text Marked By [* * *] Has Been Omitted Pursuant To A Request For Confidential Treatment And Was Filed Separately With The Securities And Exchange Commission. STRATEGIC ALLIANCE AGREEMENT Effective Date: April 17, 2017 THIS STRATEGIC ALLIANCE AGREEMENT (this “Agreement”), is entered into by and between Lion Biotechnologies, Inc., with a place of business located at 999 Skyway Road, Suite 150, San Carlos, CA 94070 (“LBIO”), and The University of Texas M. D. Anderson Cancer Center, with a place of business located at 1515 Holcombe Blvd., Houston, TX 77030 (“MD Anderson”), a member institution of The University of Texas System (“System”), as of the date set forth above (the “Effective Date”). MD Anderson and LBIO are hereinafter individually referred to as a “Party” and are collectively known as the “Parties”. WHEREAS, as a comprehensive cancer research, treatment, and educational center, MD Anderson undertakes research and experimental activities in a variety of disciplines;", "labels": []}
{"id": 229, "text": "Exhibit 10.9 TURN - KEY MANUFACTURING AGREEMENT This Turn - Key Manufacturing Agreement (the “Agreement”) is effective as of the 1.4.2011 (the “Effective Date”) by and between: INVASIX LTD., with a principal place of business at Tavor Building, Shaar Yokneam, POB 533, Yokneam 20692, Israel. Hereinafter referred to as “Customer” And FLEXTRONICS ISRAEL LTD. with a principal place of business at Industrial Zone Migdal Haemek 23108 P.O.B. 867, Israel. Hereinafter referred to as “Contractor.” Whereas Customer designs, manufactures and sells the Products as defined in Exhibit A attached hereto, which includes subassemblies components and know- how, that is confidential and proprietary property of Customer; Whereas Customer desires to buy manufacturing services; Whereas Contractor is in the business of Turn – Key projects; Whereas Customer acknowledges that Contractor’s expertise is manufacturing and that Contractor’s responsibility related to the Customer’s Products is limited to this extent", "labels": []}
{"id": 230, "text": "Exhibit 10.6 ATTACHMENT A ERCHONIA CORPORATION EXCLUSIVE DISTRIBUTOR AGREEMENT This agreement (“Agreement”) is made by and between Erchonia Corporation. (“Erchonia”) whose address is 650 Atlantis Rd., Melbourne, Florida, USA, 32904 and InnerScope Hearing Technologies Inc, (“Distributor”) whose address is 2151 Professional Drive, Second Floor, Roseville, California, USA, 95661 hereafter referred to collectively as the (“Parties”). Recitals A. Erchonia is engaged in, among other things, the business of developing and promoting low level lasers. Erchonia desires to retain Distributor to promote, distribute and sell such equipment listed in Schedule A (the “Products”). B. Distributor is engaged in the business of, among other things, selling medical products and services, specifically for the treatment of hearing disorders. C. Distributor desires to obtain the exclusive right to distribute the Products pursuant to the terms set for in this Agreement. D. The parties agree that these recital", "labels": []}
{"id": 245, "text": "Exhibit 4.15 THE SYMBOL “*” DENOTES PLACES WHERE PORTIONS OF THIS DOCUMENT HAVE BEEN OMITTED PURSUANT TO A REQUEST FOR CONFIDENTIAL TREATMENT. SUCH MATERIAL WILL BE FILED SEPARATELY WITH THE SECURITIES AND EXCHANGE COMMISSION. PRODUCT MANUFACTURING AGREEMENT This Product Manufacturing Agreement (“Agreement”) is made as of the Effective Date by and between DEXCEL LTD., with its registered address at *, Israel (“Dexcel”) and KITOV Pharma Ltd., with its registered office at 132 Menachem Begin Road, Azrieli Center, Tel Aviv, 6701101, Israel (“Kitov”). Dexcel and Kitov are hereinafter jointly the “Parties” and individually a “Party.” WHEREAS: Dexcel is a pharmaceutical company engaged in various activities including, but not limited to, the research, development, manufacture, and marketing of various drugs and pharmaceutical specialties in various dosage forms; WHEREAS: Kitov is a pharmaceutical company engaged in various activities including, but not limited to, the development of pharmace", "labels": []}
{"id": 253, "text": "EXHIBIT 10.2 [LOGO AMERICAN EXPRESS] INCENTIVE SERVICES RESELLER INFORMATION Company Name: Schoolpop, Inc. Address:3885 Crestwood Parkway, Suite 550 City: Duluth State: GA Zip: 30096 Contact Name: Paul Robinson Phone: 770-638-5101 Fax: 770-638-5101 TAX ID #: E mail Add: probinson@Schoolpop.com AMERICAN EXPRESS INCENTIVE SERVICES STORED VALUE PRODUCTS RESELLER AGREEMENT This Distribution Agreement (the \"Agreement\") is entered into by and between American Express Incentive Services, L.L.C., a Missouri limited liability company (\"AEIS\"), and its Reseller, Schoolpop, Inc., a Delaware corporation (\"Schoolpop\"). This Agreement is effective as of August 1, 2004, (the \"Effective Date\") and shall terminate on July 31, 2009, (the \"Termination Date\") unless earlier terminated or extended as provided for herein. The following points outline this agreement: 1. PURPOSE Under and subject to the terms of this Agreement: a. AEIS will provide Schoolpop for resale the following stored value cards: Encomp", "labels": []}
{"id": 254, "text": "EXHIBIT 10.9 DISTRIBUTOR AGREEMENT This Distributor Agreement (the ‘Agreement’) dated [*] is between Lucid Inc., a New York corporation, having a principal place of business at 2320 Brighton Henrietta T/L Road, Rochester NY 14623 And [*] (‘Distributor’) For good and valuable consideration, the parties hereby agree: 1. Appointment A) Lucid appoints the Distributor and the Distributor accepts appointment as an exclusive authorized Lucid Distributor. The Distributor will be entitled to purchase certain Lucid products and resell them to End User customers within the following market segments:- hospital and medical research centres, including but not limited to dermatology, pathology, plastic surgery and mohs surgery departments, clinical research centres, small animal research facilities, cosmetic and cosmeceutical companies. B) The relationship of the parties under this Agreement is that of independent contractors and nothing contained herein shall be construed as creating any partnership", "labels": []}
{"id": 258, "text": "Exhibit 10.26 EXECUTION VERSION CONFIDENTIAL DOMAIN NAME AND CONTENT LICENSE AGREEMENT This Domain Name and Content License Agreement (the “Agreement”) is made and entered into, by and between Beijing SINA Internet Information Service Co., Ltd. (北京新浪互联信息服务有限公司), a limited liability company organized under the laws of the People’s Republic of China (hereinafter “Licensor”) and Beijing Yisheng Leju Information Services Co., Ltd., a limited liability company organized under the laws of the People’s Republic of China (“Licensee” and together with Licensor, the “Parties” and each a “Party”) and is made effective as of the Effective Date (defined below). RECITALS WHEREAS, SINA Corporation, a company organized under the laws of the Cayman Islands (“SINA”), and CRIC Holdings Limited, a company organized under the laws of the Cayman Islands (“CRIC”), entered into that certain Share Purchase Agreement dated July 23, 2009 (the “Share Purchase Agreement”), pursuant to which SINA subscribes from CR", "labels": []}
{"id": 263, "text": "Exhibit 10.16 SUPPLY CONTRACT Contract No: Date: The buyer/End-User: Shenzhen LOHAS Supply Chain Management Co., Ltd. ADD: Tel No. : Fax No. : The seller: ADD: The Contract is concluded and signed by the Buyer and Seller on , in Hong Kong. 1. General provisions 1.1 This is a framework agreement, the terms and conditions are applied to all purchase orders which signed by this agreement (hereinafter referred to as the “order”). 1.2 If the provisions of the agreement are inconsistent with the order, the order shall prevail. Not stated in order content will be subject to the provisions of agreement. Any modification, supplementary, give up should been written records, only to be valid by buyers and sellers authorized representative signature and confirmation, otherwise will be deemed invalid. 2. The agreement and order 2.1 During the validity term of this agreement, The buyer entrust SHENZHEN YICHANGTAI IMPORT AND EXPORT TRADE CO., LTD or SHENZHEN LEHEYUAN TRADING CO, LTD (hereinafter refe", "labels": []}
{"id": 296, "text": "1 EXHIBIT 10.4 SPONSORSHIP AGREEMENT This Sponsorship Agreement is made between National Processing Company (\"NPC\") and National City Bank of Kentucky (\"NCB\") effective June 30, 1996 (\"Effective Date\"). WITNESSETH: WHEREAS, NCB is a member in good standing of Visa U.S.A., Inc. (\"Visa\") and a member in good standing of MasterCard International, Incorporated (\"MasterCard\"); and WHEREAS, NPC, pursuant to its arrangements with NCB, a member of Visa and MasterCard, provides data processing, settlement and authorization services for merchants who participate in the Visa and MasterCard bankcard programs (such activities being referred to as \"Merchant Bankcard Business\"); and WHEREAS, NPC and NCB have concluded that it is in their mutual best interests for NPC to continue to act as an agent of NCB for purposes of providing data processing, settlement and authorization services for merchants with respect to their Visa and MasterCard transactions and in connection with such agency arrangement, f", "labels": []}
{"id": 305, "text": "EXHIBIT 10.3 NETZEE, INC. MAINTENANCE AGREEMENT This Agreement provides for Continued Service and for Netzee to provide basic maintenance in support following expiration of the initial one (1) year term of the License/Services Schedule. The Continued Service provided by Netzee will be the operation, maintenance, and support of the computer systems, software and interfaces included in the System. Bankers Bank agrees to pay fees equal to $40 per month for all Participating Banks (original or added) for which maintenance is provided. The maintenance is for a period of one (1) year commencing upon expiration of the initial one (1) year term of the License/Services Schedule. Following the completion of such maintenance term, Bankers Bank may, at its option, renew maintenance for subsequent periods of one (1) year each, subject to adjustments proposed by Netzee not to exceed 5% at least sixty (60) days in advance of the applicable renewal date. Maintenance provided by Netzee during the term ", "labels": []}
{"id": 309, "text": "Exhibit s.2 NUVEEN AMT-FREE MUNICIPAL CREDIT INCOME FUND (NVG) AND NUVEEN FUND ADVISORS, LLC AND [●] REMARKETING AGREEMENT Dated as of [●] Series [●] MuniFund Preferred Shares Variable Rate Remarketed Mode (NVG – Series [●] MFP) Table of Contents Page Section 1. Definitions 1 Section 2. Appointment and Obligations of the Remarketing Agent 3 Section 3. Representations, Warranties and Covenants of the Remarketing Agent and the Fund 6 Section 4. Fees and Expenses 7 Section 5. Resignation, Suspension and Removal of the Remarketing Agent 7 Section 6. Dealing in the VRRM-MFP Shares 7 Section 7. Information 8 Section 8. Conditions to Obligations of the Remarketing Agent 9 Section 9. Indemnification 9 Section 10. Termination of Remarketing Agreement 12 Section 11. Remarketing Agent’s Performance; Duty of Care 13 Section 12. Amendment, Supplement or Modification of Agreements 13 Section 13. Books and Records 13 Section 14. Governing Law 13 Section 15. Waiver of Jury Trial 14 Section 16. Certain", "labels": []}
{"id": 314, "text": "Exhibit 10.14 License and Development Agreement “Agreement” between NLS-1 Pharma AG Alter Postplatz 2 6370 Stans Switzerland “Licensor” / “NLS” and Eurofarma Laboratórios S.A. Avenida Vereador José Diniz 3465 04603-003 São Paulo Brazil “Licensee” / “Eurofarma” (Licensor and Licensee each a ʺPartyʺ collectively the ʺPartiesʺ) regarding Nolazol® (Mazindol CR) in ADHD – Latin America Source: NLS PHARMACEUTICS LTD., F-1, 2/28/2020 License and Development Agreement Table of Content WHEREAS 1 1. Definitions 1 2. Grant of License 4 2.1. Grant of rights 4 2.2. Restrictions 4 3. License Fees and Milestone Payments 5 3.1. Upfront Payment 5 3.2. Milestone payments 5 3.3. Royalties 6 3.4. Reports 6 3.5. Records and Audits 6 3.6. Payment Terms 7 4. Business Plan 7 5. Development Work 8 6. Further Development Work 8 7. Brand Name and Trademarks 9 8. Labelling and Packaging 9 9. Regulatory Obligations and Procedures 10 9.1. Regulatory Obligations and Procedures in General 10 9.2. Notifications 10 9.3", "labels": []}
{"id": 326, "text": "DISTRIBUTOR AGREEMENT 1. CERTIFICATION AND IDENTIFICATION: COMWARE TECHNICAL SERVICES OF 17922 SKY PARK CIRCLE, SUITE E, IRVINE, CALIFORNIA 92614-6414 (COMWARE) certifies that the Products furnished under this agreement by INTERNATIONAL TEST SYSTEMS, INC. OF 4703 SHAVANO OAK, SUITE 102, SAN ANTONIO, TEXAS 78249 (ITS) will be incorporated by COMWARE as a part of COMWARE'S systems which COMWARE sells or leases to unaffiliated third parties in the regular course of COMWARE'S business and that COMWARE'S own contribution to these systems reflect a verifiable value added. COMWARE also represents that it is an experienced user of computer equipment and software sufficiently like the Products, as defined below, and that it needs only minor support in the incorporation of the Products into its lines of business. 2. DEFINITIONS: INITIAL DISTRIBUTION PERIOD: April 15, 2000 through October 15, 2000 (6 Months from the Effective Date) PRODUCTS: The CircuiTest 2000S In-Circuit Test System The CircuiT", "labels": []}
{"id": 334, "text": "STRATEGIC ALLIANCE AGREEMENT This agreement (“Agreement”), is entered into as of the date on which the Registration Statement is declared effective by the SEC (the “Effective Date”), by and among PHL VARIABLE INSURANCE COMPANY (“PHLVIC”), PHOENIX LIFE INSURANCE COMPANY, (“PLIC” and, together with PHLVIC, “PHL Variable”), PHOENIX EQUITY PLANNING CORPORATION (“PEPCO” and, together with PHLVIC and PLIC, the “PHL Parties”), and INVESTORS CAPITAL CORPORATION (“ICC”). Except as otherwise defined, capitalized terms used herein shall have the meanings given to them in Section 1 Definitions, below. RECITALS A. PHL Variable will offer to issue the GIE to ICC Customers. B. ICC is a broker dealer that is registered under the 1934 Act and with FINRA and an investment adviser that is registered with the SEC under the Advisers Act and doing business as an investment adviser as Investors Capital Advisory Services (“ICAS”). C. ICAS has established certain asset allocation Models that are eligible for u", "labels": []}
{"id": 337, "text": "Exhibit 99.1 JOINT FILING AGREEMENT Additional Reporting Person (a): Merck Serono SA Address: Zone Industrielle 1267 Coinsins, Switzerland Additional Reporting Person (b): Merck KGaA Address: Frankfurter Str. 250 64293 Darmstadt, Germany Designated Filer: Ares Trading SA Issuer and CUSIP: Intrexon Corporation (46122T102) Dated: January 7, 2019 ARES TRADING SA ARES TRADING SA By: /s/ Cédric Hyde By: /s/ Luigia Bocola Name: Cédric Hyde Name: Luigia Bocola Title: CFO Title: Finance Manager MERCK SERONO SA, COINSINS, SWITZERLAND, AN AFFILIATE OF MERCK KGAA, DARMSTADT, GERMANY MERCK SERONO SA, COINSINS, SWITZERLAND, AN AFFILIATE OF MERCK KGAA, DARMSTADT, GERMANY By: /s/ Cédric Hyde By: /s/ Tearaboth Te Name: Cédric Hyde Name: Tearaboth Te Title: CFO Title: Treasury Director MERCK KGAA, DARMSTADT, GERMANY MERCK KGAA, DARMSTADT, GERMANY By: /s/ Rando Bruns By: /s/ Tim Nielsen Name: Rando Bruns Name: Tim Nielsen Title: Head of Treasury Title: Head of Capital Markets", "labels": []}
{"id": 345, "text": "Exhibit 10.4 CO-BRANDING AGREEMENT This Co-Branding Agreement (this \"Agreement\") dated September 30, 1999 (the \"Effective Date\") is entered into between VerticalNet, Inc., a Pennsylvania corporation having a principal place of business at 700 Dresher Road, Suite 100, Horsham, Pennsylvania, PA 19044 (\"VerticalNet\"), and PaperExchange.com, LLC, a Delaware limited liability company having a principal place of business at 545 Boylston Street, 8th Floor, Boston, MA 02116 (\"PaperExchange\"). In consideration of the mutual covenants herein, and intending to be legally bound hereby, the parties agree as follows: 1. DEFINITIONS 1.1. Affiliate shall mean, when used with reference to a party, any individual or entity directly or indirectly controlling, controlled by or under common control with such party. For purposes of this definition, \"control\" means the direct or indirect ownership of at least 50% of the outstanding voting securities of a party, or the right to control the policy decisions of", "labels": []}
{"id": 355, "text": "FORM OF FRANCHISE AGREEMENT Location of the Premises: Agreement Date Franchisee Business Address Type of Legal Entity (if applicable) State in which entity organized (if applicable) Shareholder / Partner / Member Name Ownership Percentage % (the “Operating Principal”) % % % % Source: PF HOSPITALITY GROUP INC., 10-12G, 9/23/2015 TABLE OF CONTENTS SECTION PAGE 1. RIGHTS GRANTED 2 2. TERM; SUCCESSOR FRANCHISE AGREEMENTS 4 3. FEES 4 4. OPENING DEADLINE 6 5. TRAINING 10 6. OPERATIONS 11 7. PROPRIETARY MARKS 18 8. BUSINESS RECORDS AND REPORTING 19 9. MARKETING FUND AND ADVERTISING 21 10. TECHNOLOGY 23 11. OPERATING MANUAL 26 12. CONFIDENTIAL INFORMATION 26 13. TRANSFERS BY US 26 14. TRANSFERS BY YOU 27 15. TERMINATION 29 16. OBLIGATIONS ON TERMINATION OR EXPIRATION 31 17. RESTRICTIONS ON COMPETITION 33 18. RELATIONSHIP OF THE PARTIES 34 19. INDEMNIFICATION 35 20. CONSENTS AND WAIVERS 35 21. NOTICES 35 22. ENTIRE AGREEMENT AND AMENDMENTS 35 23. CONSTRUCTION OF THE AGREEMENT, SEVERABILITY, AND", "labels": []}
{"id": 362, "text": "Exhibit 8 SUPPLIER/SUBCONTRACTOR CONTRACT 1. By execution of this Supplier/Subcontractor Contract (“Contract”), (“Supplier”) agrees and acknowledges that: (i) all images and/or trademarks, including, but not limited to PLAYBOY, (the “Playboy Properties”) applied at the request of (“Purchaser”) to merchandise covered by this Contract are owned by Playboy Enterprises International, Inc. (“Playboy”), and when used upon merchandise means that such merchandise is sponsored, approved, recommended or sold by Playboy or its licensees; (ii) Supplier will not sell, ship or otherwise dispose of any such merchandise except upon the order of Purchaser or Playboy; (iii) Supplier will never make, cause others to make or assist others in making, any claim whatsoever to any or all of the Playboy Properties or any trademark, copyright, designation, name, phrase, design or symbol similar thereto in connection with the manufacture, advertising, promotion, sale or distribution of merchandise; and (iv) Supp", "labels": []}
{"id": 372, "text": "Exhibit 4.23 Rise Education Group SERVICE AGREEMENT This Service Agreement (this “Agreement”) is entered into as of [Date] in Beijing, China, by and between: Party A: Rise (Tianjin) Education Information Consulting Co., Ltd. (“Service Provider”) Address: Room C209, C210, C213, C214, C217 and C218, 2/F, Building 1, No. 8 Huanhe West Road, Airport Economic Zone, Tianjin, China Party B: [•] (“Service Recipient”) Address: [•] Whereas: 1. Service Provider is a company with adequate financial and other resources in the field of English teaching and training for children, capable of providing valuable and sophisticated educational services solutions to educational institutions and teachers; 2. Service Recipient engages in the field of English teaching and training for children. Service Recipient agrees to accept Service Provider’s services as specified in this Agreement and utilize Service Provider’s resources to provide services to relevant education and training institutions. This Agreement", "labels": []}
{"id": 397, "text": "Exhibit 4(b)(ii).3 [LOGO] sicap Maintenance and support contract for SICAP(R) modules PPB, VCA and OTA dated 10 October 2000 This contract replaces in full the Annex 7 \"Maintenance and Support for SICAP(R) modules PPB, VCA and OTA and Sun Hardware\" which was an integral part of the original Swisscom PURCHASE & LICENSE CONTRACT, made effective on 06 April 1998. concluded between: EuroTel Bratislava a.s., Stefanikova 17, PO Box 54, 838 01 Bratislava 38, Slovakia and Sicap Ltd, Bernstrasse 34, 3072 Ostermundigen, Switzerland. [LOGO] sicap M&S contract Table of contents 1 INTRODUCTION 4 1.1 Standard service 4 1.2 Over all responsibilities 4 1.3 Additional service on request (as per clause 5) 5 2 PROCEDURES FOR SUPPORT 5 2.1 Hotline ISC SICAP(R)(Case of incidents) 5 2.2 Procedures for incidents 5 2.3 Main flowchart 6 3 RESPONSE TIME 8 3.1 Response time for hotline 8 3.1.1 Working hours at Sicap Ltd 8 3.2 Emergency priority 8 4 CHANGE MANAGEMENT 9 4.1 Responsibilities 9 4.2 Procedures 9 5 AD", "labels": []}
{"id": 418, "text": "Exhibit 10.38 EXHIBIT C Software License Agreement [v.08.05.03] PLEASE READ THIS SOFTWARE LICENSE AGREEMENT CAREFULLY BEFORE DOWNLOADING, INSTALLING OR USING CISCO OR CISCO- SUPPLIED SOFTWARE. BY DOWNLOADING OR INSTALLING THE SOFTWARE, OR USING THE EQUIPMENT THAT CONTAINS THIS SOFTWARE, YOU ARE BINDING THE BUSINESS ENTITY THAT YOU REPRESENT (\"CUSTOMER\") TO THIS AGREEMENT. IF YOU DO NOT AGREE TO ALL OF THE TERMS OF THIS AGREEMENT, THEN (A) DO NOT DOWNLOAD, INSTALL OR USE THE SOFTWARE, AND (B) YOU MAY RETURN THE SOFTWARE FOR A FULL REFUND, OR, IF THE SOFTWARE IS SUPPLIED AS PART OF ANOTHER PRODUCT, YOU MAY RETURN THE ENTIRE PRODUCT FOR A FULL REFUND. YOUR RIGHT TO RETURN AND REFUND EXPIRES 30 DAYS AFTER PURCHASE FROM CISCO OR AN AUTHORIZED CISCO RESELLER, AND APPLIES ONLY IF CUSTOMER IS THE ORIGINAL END USER PURCHASER. The following terms of this Software License Agreement (\"Agreement') govern Customer's access and use of the Software, except to the extent (a) there is a separate signed ", "labels": []}
{"id": 426, "text": "Attachment B to Master Franchise Agreement GUARANTEES OF MASTER FRANCHISE AGREEMENT As an i nducemen t t o K iosk Concep t s , I nc. ( “F ranch i so r ” ) t o en t e r i n to a Mas t e r F r anch i s e Agreemen t w i th N/A (“Master Franchisee”) dated , 20 (the “ Master Franchise Agreement”), (“Guarantors”), jointly and severally agree as follows: A. Guarantors shall pay or cause to be paid to Franchisor all monies payable by Master Franchisee under the Master Franchise Agreement on the days and times and in the manner therein appointed for payment thereof. B. Guarantors shall unconditionally guarantee full performance and discharge by Master Franchisee of all the obligations of Master Franchisee under the Master Franchise Agreement at the times and in the manner therein provided. C. Guarantors shall indemnify and save harmless Franchisor and its affiliates against and from all losses, damages, costs, and expenses which Franchisor and its affiliates may sustain, incur, or become liable", "labels": []}
{"id": 427, "text": "Attachment C to Master Franchise Agreement MULTI-STATE ADDENDUM CALIFORNIA APPENDIX 1. California Business and Professions Code Sections 20000 through 20043 provide rights to you concerning termination or non-renewal of a franchise. If the Master Franchise Agreement contains provisions that are inconsistent with the law, the law will control. 2. The Master Franchise Agreement provides for termination upon bankruptcy. This provision may not be enforceable under Federal Bankruptcy Law (11 U.S.C.A. Sec. 101 et seq. ). 3. The Master Franchise Agreement contains covenants not to compete which extend beyond the termination of the agreement. These provisions may not be enforceable under California law. 4. Section 31125 of the California Corporation Code requires the franchisor to provide you with a disclosure document before asking you to agree to a material modification of an existing franchise. 5. Neither the franchisor, any person or franchise broker in Item 2 of the Disclosure Document is", "labels": []}
{"id": 429, "text": "Exhibit 10.8 Affiliate Program / Premium Affiliate Management General Terms and Conditions The following General Terms and Conditions are intended for (i) Web site owners (hereafter, \"Affiliates\") who wish to participate as Affiliates in the Affiliate Program provided by element 5 (governed by II. and IV. in these General Terms and Conditions) on the basis of these General Terms and Conditions and also for (ii) Software Publishers who distribute their software products as downloads using the services of element 5 GmbH, Vogelsanger Strasse 78, 50823 Cologne, Germany and its subsidiaries (together hereafter, \"element 5\") and who wish to make use of the additional service provided by element 5 (hereafter, \"Affiliate Management\", governed under III. and IV. in these General Terms and Conditions) for integration of the Affiliate Program provided by element 5. I. Object of the Affiliate Program/ Affiliate Management Program for Software Publishers The object of the Affiliate Program provided", "labels": []}
{"id": 430, "text": "Exhibit 10.37 DISTRIBUTORSHIP AGREEMENT THIS DISTRIBUTORSHIP AGREEMENT (the “Agreement”) is entered into and made effective as of (the “Effective Date”), by and between STAAR SURGICAL AG, a Swiss corporation, with a principal place of business at Hauptstrasse 104, CH - 2560 Nidau, Switzerland, (“STAAR”), and , a corporation organized and existing under the laws of , with its principal place of business at (“Distributor”). Recitals A. STAAR is engaged in the manufacture, global distribution and sale of ophthalmic products, including a range of devices for cataract, glaucoma and refractive surgery. B. Distributor is engaged in and has experienced and trained personnel for the marketing, distribution and sale of ophthalmic products in . C. STAAR desires to engage Distributor, and Distributor desires to be engaged by STAAR, to market, distribute and sell the Products (as defined below) in on the terms and conditions set forth herein. NOW, THEREFORE, in consideration of the foregoing premis", "labels": []}
{"id": 460, "text": "EXHIBIT 10.11 NETWORK 1 FINANCIAL CORPORATION AFFILIATE OFFICE AGREEMENT THIS AGREEMENT is entered into by and between NETWORK 1 FINANCIAL, INC. (\"NETWORK 1\"), a Virginia Corporation with its principal place of business at 1501 Farm Credit Drive, Suite 1500, McLean, Virginia 22102-5004, and Payment Data Systems, Inc., the Affiliate Office (\"AFFILIATE\"), a Nevada Corporation with its principal place of business at 12500 San Pedro Suite 120 San Antonio, TX 78216. NETWORK 1 and Affiliate hereby agree as follows: RECITALS WHEREAS, Network 1 Financial, Inc. (\"Network 1\") provides through various Member Bank(s) (\"Member\"), VISA and MasterCard processing and related payment processing services (\"Services\") to merchant(s) (\"Merchant(s)\") in accordance with the terms of certain Agreement (s) between Network 1, Member and other settlement/transaction processing providers; and WHEREAS, the Network 1 desires to locate individuals to market Services as Contractor(s) (the \"Contractors\") of Network 1", "labels": []}
{"id": 486, "text": "Exhibit 10.8 eGAIN COMMUNICATIONS CORPORATION HOSTING AGREEMENT 1. Hosting Agreement. This Agreement (including its Exhibit A and all other documents referenced herein) is entered into by eGain Communications Corporation (\"eGain\") and Eliance Corporation (\"Customer\") for the purpose of providing Customer with Web-based access to eGain's software specified in Exhibit A, including any updates, upgrades or revisions provided under this Agreement (\"Software\"), and certain other services relating to the processing of and response to online inquiries and messages (\"Online Messages\") received by Customer from its customers and other users of Customer's Web site (\"Users\"). 2. Provision of Services. eGain will provide Customer with access, maintenance and related hosting services (\"Hosting Services\") to the Software installed on eGain's servers and other equipment (the \"eGain System\"). Customer agrees, as reasonably requested by eGain, to provide eGain with access to Customer's premises and equ", "labels": []}
{"id": 489, "text": "Exhibit 10.26 CONFIDENTIAL TREATMENT HAS BEEN REQUESTED AS TO CERTAIN PORTIONS OF THIS DOCUMENT. EACH SUCH PORTION, WHICH HAS BEEN OMITTED HEREIN AND REPLACED WITH AN ASTERISK [*], HAS BEEN FILED SEPARATELY WITH THE SECURITIES AND EXCHANGE COMMISSION. PROMOTION AND DISTRIBUTION AGREEMENT This Promotion and Distribution Agreement including all exhibits (collectively referred to as the “Agreement”), effective as of 1 August 2011 (the “Effective Date”), is made by and between Whitesmoke Inc., with registered offices/principle place of business at 501 Silverside Road, Suite 105, Wilmington DE 19809, USA, (“Distributor”), and Google Inc whose principle place of business is at 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA (“Google”). “Bundle” means the Distribution Products bundled with the Distributor App(s). “Chrome Browser” means the machine-readable binary code version of the Google Chrome browser provided to Distributor in connection with this Agreement, and any modifications ", "labels": []}
{"id": 490, "text": "-8- 9 EXECUTION COPY 11.6. COUNTERPARTS. This Agreement may be executed in two or more counterparts, each of which shall be deemed an original, but all of which together shall constitute one and the same instrument. 11.7. INTELLECTUAL PROPERTY RIGHTS, CONFIDENTIALITY AND NON-USE. The Professional acknowledges her obligations under the provisions of the Intellectual Property Rights Confidentiality and Non-Use Obligations Agreement attached hereto as \"Exhibit A\" and made a part hereof by this reference. The rights and obligations of the parties set forth in Exhibit A shall survive the termination or expiration of this endorsement agreement, regardless of cause or circumstances of the termination or expiration. IN WITNESS WHEREOF, the parties have executed this Agreement as of the date first above written. SQUARE TWO GOLF, INC. By: /s/DOUGLAS A. BUFFINGTON Douglas A. Buffington President PROFESSIONAL /s/ KATHY WHITWORTH Kathy Whitworth -9- 10 EXECUTION COPY EXHIBIT A Intellectual Property", "labels": []}
{"id": 494, "text": "Exhibit 10.1 Oceanic Time Warner Cable and Watchit Media Content and License Agreement Effective Dates: September 1, 2006, August 31, 2007 Watchit agrees to provide Oceanic Time Warner Cable the following content: – Watchit Gaming Guides – Lunchtime with Ira segments every week Watchit will provide the content on BetaSp format and reserves the right to modify the content to reflect sponsorship by an advertiser and advertisers. Oceanic Time Warner Cable agrees to not edit or modify the above content. Oceanic Time Warner Cable will use the content solely on channel 777, the Las Vegas channel. In the event that Oceanic Time Warner Cable removes the above content and or terminates this agreement prior to December 31, 2006, Oceanic Time Warner Cable agrees to pay a cancellation fee of Five Thousand Dollars ($5,000) per month multiplied by the number of months remain on the agreement. Watchit shall have the exclusive right to sell third party advertising as sponsors of their content and will", "labels": []}